Tag Tool [1.0.5907.15260]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...22310 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 10:40 AM.
Reading stringIDs...37378 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> echo   reminder, end of TTCC tags list if you use TTCC
reminder, end of TTCC tags list if you use TTCC 
tags.dat> 

tags.dat> echo  injecting wall models
injecting wall models 
tags.dat> 

tags.dat> modeltest 3450 objects/wall_xxl.obj
Info,  T11288: Load objects/wall_xxl.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1992 out: 1059 | ~46.8%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 344D objects/wall_xl.obj
Info,  T11288: Load objects/wall_xl.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1992 out: 1038 | ~47.9%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 344A objects/wall_l.obj
Info,  T11288: Load objects/wall_l.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1992 out: 1039 | ~47.8%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 3447 objects/wall_m.obj
Info,  T11288: Load objects/wall_m.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1992 out: 1095 | ~45.0%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 3444 objects/wall_s.obj
Info,  T11288: Load objects/wall_s.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1992 out: 1124 | ~43.6%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> echo  injecting box models
injecting box models 
tags.dat> 

tags.dat> modeltest 3441 objects/box_xxl.obj
Info,  T11288: Load objects/box_xxl.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 1362 out: 344 | ~74.7%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 343E objects/box_xl.obj
Info,  T11288: Load objects/box_xl.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 3000 out: 1155 | ~61.5%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 343B objects/box_l.obj
Info,  T11288: Load objects/box_l.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 3000 out: 1170 | ~61.0%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 3438 objects/box_m.obj
Info,  T11288: Load objects/box_m.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 3000 out: 1162 | ~61.3%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 3434 objects/box_s.obj
Info,  T11288: Load objects/box_s.obj

Info,  T11288: Found a matching importer for this file format

Info,  T11288: Import root directory is 'objects\'

Info,  T11288: Entering post processing pipeline

Info,  T11288: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T11288: Kept 0 lights and 0 cameras

Info,  T11288: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T11288: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T11288: CalcTangentsProcess finished. Tangents have been calculated

Info,  T11288: JoinVerticesProcess finished | Verts in: 3000 out: 1163 | ~61.2%

Info,  T11288: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> echo  adding shaders to boxes
adding shaders to boxes 
tags.dat> 

tags.dat> edit 3441
Tag 0x00003441.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3441.render_model> specifyshaders
Please enter the replacement 0000101F index: 46B4
Done!

tags.dat\0x3441.render_model> exit

tags.dat> 

tags.dat> edit 343E
Tag 0x0000343E.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343E.render_model> specifyshaders
Please enter the replacement 0000101F index: 46B4
Done!

tags.dat\0x343E.render_model> exit

tags.dat> 

tags.dat> edit 343B
Tag 0x0000343B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343B.render_model> specifyshaders
Please enter the replacement 0000101F index: 46B4
Done!

tags.dat\0x343B.render_model> exit

tags.dat> 

tags.dat> edit 3438
Tag 0x00003438.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3438.render_model> specifyshaders
Please enter the replacement 0000101F index: 46B4
Done!

tags.dat\0x3438.render_model> exit

tags.dat> 

tags.dat> edit 3434
Tag 0x00003434.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3434.render_model> specifyshaders
Please enter the replacement 0000101F index: 46B4
Done!

tags.dat\0x3434.render_model> exit

tags.dat> 

tags.dat> echo  adding shaders to walls
adding shaders to walls 
tags.dat> 

tags.dat> edit 3450
Tag 0x00003450.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3450.render_model> specifyshaders
Please enter the replacement 0000101F index: 46b4
Done!

tags.dat\0x3450.render_model> exit

tags.dat> 

tags.dat> edit 344D
Tag 0x0000344D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344D.render_model> specifyshaders
Please enter the replacement 0000101F index: 46b4
Done!

tags.dat\0x344D.render_model> exit

tags.dat> 

tags.dat> edit 344A
Tag 0x0000344A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344A.render_model> specifyshaders
Please enter the replacement 0000101F index: 46b4
Done!

tags.dat\0x344A.render_model> exit

tags.dat> 

tags.dat> edit 3447
Tag 0x00003447.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3447.render_model> specifyshaders
Please enter the replacement 0000101F index: 46b4
Done!

tags.dat\0x3447.render_model> exit

tags.dat> 

tags.dat> edit 3444
Tag 0x00003444.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3444.render_model> specifyshaders
Please enter the replacement 0000101F index: 46b4
Done!

tags.dat\0x3444.render_model> exit

tags.dat> 

tags.dat> echo  making objects visible from further away to prevent them from disapearing when close. 
making objects visible from further away to prevent them from disapearing when close. 
tags.dat> 

tags.dat> edit 2ee9
Tag 0x00002EE9.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EE9.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EE9.crate> savechanges
Done!

tags.dat\0x2EE9.crate> exit

tags.dat> 

tags.dat> edit 3433
Tag 0x00003433.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3433.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3433.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3433.model> savechanges
Done!

tags.dat\0x3433.model> exit

tags.dat> 

tags.dat> edit 2EEA
Tag 0x00002EEA.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEA.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEA.crate> savechanges
Done!

tags.dat\0x2EEA.crate> exit

tags.dat> 

tags.dat> edit 3437
Tag 0x00003437.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3437.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3437.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3437.model> savechanges
Done!

tags.dat\0x3437.model> exit

tags.dat> 

tags.dat> edit 2EEB
Tag 0x00002EEB.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEB.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEB.crate> savechanges
Done!

tags.dat\0x2EEB.crate> exit

tags.dat> 

tags.dat> edit 343A
Tag 0x0000343A.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343A.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x343A.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x343A.model> savechanges
Done!

tags.dat\0x343A.model> exit

tags.dat> 

tags.dat> 

tags.dat> edit 2EEC
Tag 0x00002EEC.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEC.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEC.crate> savechanges
Done!

tags.dat\0x2EEC.crate> exit

tags.dat> 

tags.dat> edit 343D
Tag 0x0000343D.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343D.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x343D.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x343D.model> savechanges
Done!

tags.dat\0x343D.model> exit

tags.dat> 

tags.dat> edit 2EED
Tag 0x00002EED.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EED.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EED.crate> savechanges
Done!

tags.dat\0x2EED.crate> exit

tags.dat> 

tags.dat> edit 3440
Tag 0x00003440.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3440.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3440.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3440.model> savechanges
Done!

tags.dat\0x3440.model> exit

tags.dat> 

tags.dat> echo  walls viewdistance
walls viewdistance 
tags.dat> 

tags.dat> edit 2EEE
Tag 0x00002EEE.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEE.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEE.crate> savechanges
Done!

tags.dat\0x2EEE.crate> exit

tags.dat> 

tags.dat> edit 3443
Tag 0x00003443.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3443.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3443.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3443.model> savechanges
Done!

tags.dat\0x3443.model> exit

tags.dat> 

tags.dat> edit 2EEF
Tag 0x00002EEF.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEF.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEF.crate> savechanges
Done!

tags.dat\0x2EEF.crate> exit

tags.dat> 

tags.dat> edit 3446
Tag 0x00003446.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3446.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3446.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3446.model> savechanges
Done!

tags.dat\0x3446.model> exit

tags.dat> 

tags.dat> edit 2EF0
Tag 0x00002EF0.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF0.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF0.crate> savechanges
Done!

tags.dat\0x2EF0.crate> exit

tags.dat> 

tags.dat> edit 3449
Tag 0x00003449.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3449.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3449.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3449.model> savechanges
Done!

tags.dat\0x3449.model> exit

tags.dat> 

tags.dat> edit 2EF1
Tag 0x00002EF1.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF1.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF1.crate> savechanges
Done!

tags.dat\0x2EF1.crate> exit

tags.dat> 

tags.dat> edit 344C
Tag 0x0000344C.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344C.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x344C.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x344C.model> savechanges
Done!

tags.dat\0x344C.model> exit

tags.dat> 

tags.dat> edit 2EF2
Tag 0x00002EF2.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF2.crate> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF2.crate> savechanges
Done!

tags.dat\0x2EF2.crate> exit

tags.dat> 

tags.dat> edit 344F
Tag 0x0000344F.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344F.model> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x344F.model> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x344F.model> savechanges
Done!

tags.dat\0x344F.model> exit

tags.dat> 

tags.dat> echo   create new string_id's:
create new string_id's: 
tags.dat> stringid add box_s
Added string "box_s" as 0x00009202.

tags.dat> stringid add box_m
Added string "box_m" as 0x00009203.

tags.dat> stringid add box_l
Added string "box_l" as 0x00009204.

tags.dat> stringid add box_xl
Added string "box_xl" as 0x00009205.

tags.dat> stringid add box_xxl
Added string "box_xxl" as 0x00009206.

tags.dat> stringid add wall_s
Added string "wall_s" as 0x00009207.

tags.dat> stringid add wall_m
Added string "wall_m" as 0x00009208.

tags.dat> stringid add wall_l
Added string "wall_l" as 0x00009209.

tags.dat> stringid add wall_xl
Added string "wall_xl" as 0x0000920A.

tags.dat> stringid add wall_xxl
Added string "wall_xxl" as 0x0000920B.

tags.dat> stringid add elephant
Added string "elephant" as 0x0000920C.

tags.dat> stringid add Gauss_Turret
Added string "Gauss_Turret" as 0x0000920D.

tags.dat> stringid add Chaingun_Turret
Added string "Chaingun_Turret" as 0x0000920E.

tags.dat> stringid add Wraith_Turret
Added string "Wraith_Turret" as 0x0000920F.

tags.dat> 

tags.dat> stringid add lastR_Bridge
Added string "lastR_Bridge" as 0x00009210.

tags.dat> stringid add lastR_Barricade
Added string "lastR_Barricade" as 0x00009211.

tags.dat> stringid add lastR_Light
Added string "lastR_Light" as 0x00009212.

tags.dat> stringid add lastR_Window
Added string "lastR_Window" as 0x00009213.

tags.dat> stringid add lastR_Mascot
Added string "lastR_Mascot" as 0x00009214.

tags.dat> 

tags.dat> stringid add pit_controlpanel
Added string "pit_controlpanel" as 0x00009215.

tags.dat> stringid add pit_metal
Added string "pit_metal" as 0x00009216.

tags.dat> stringid add pit_keyboard
Added string "pit_keyboard" as 0x00009217.

tags.dat> stringid add pit_pcmonitor
Added string "pit_pcmonitor" as 0x00009218.

tags.dat> stringid add pit_filecabinet
Added string "pit_filecabinet" as 0x00009219.

tags.dat> stringid add pit_sfilecabinet
Added string "pit_sfilecabinet" as 0x0000921A.

tags.dat> stringid add pit_chair
Added string "pit_chair" as 0x0000921B.

tags.dat> stringid add pit_gravlift
Added string "pit_gravlift" as 0x0000921C.

tags.dat> stringid add pit_bird
Added string "pit_bird" as 0x0000921D.

tags.dat> stringid add pit_bird2
Added string "pit_bird2" as 0x0000921E.

tags.dat> stringid add pit_bird3
Added string "pit_bird3" as 0x0000921F.

tags.dat> stringid add pit_camera
Added string "pit_camera" as 0x00009220.

tags.dat> stringid add pit_hornet
Added string "pit_hornet" as 0x00009221.

tags.dat> 

tags.dat> stringid add narrows_gravlift
Added string "narrows_gravlift" as 0x00009222.

tags.dat> stringid add narrows_core
Added string "narrows_core" as 0x00009223.

tags.dat> 

tags.dat> stringid add Highground_bunkerlid
Added string "Highground_bunkerlid" as 0x00009224.

tags.dat> stringid add Highground_chaingate
Added string "Highground_chaingate" as 0x00009225.

tags.dat> stringid add Highground_Cardboardbox
Added string "Highground_Cardboardbox" as 0x00009226.

tags.dat> stringid add Highground_CardboardboxOpen
Added string "Highground_CardboardboxOpen" as 0x00009227.

tags.dat> stringid add Highground_Cboardboxrec
Added string "Highground_Cboardboxrec" as 0x00009228.

tags.dat> stringid add Highground_Cboardbox2
Added string "Highground_Cboardbox2" as 0x00009229.

tags.dat> stringid add Highground_squaretable
Added string "Highground_squaretable" as 0x0000922A.

tags.dat> stringid add Highground_chaingate2
Added string "Highground_chaingate2" as 0x0000922B.

tags.dat> stringid add Highground_ProwlerTurret
Added string "Highground_ProwlerTurret" as 0x0000922C.

tags.dat> 

tags.dat> stringid add Sandtrap_UsncMetal
Added string "Sandtrap_UsncMetal" as 0x0000922D.

tags.dat> stringid add Sandtrap_GravityLift
Added string "Sandtrap_GravityLift" as 0x0000922E.

tags.dat> stringid add Sandtrap_Barrel
Added string "Sandtrap_Barrel" as 0x0000922F.

tags.dat> stringid add Sandtrap_crowbar
Added string "Sandtrap_crowbar" as 0x00009230.

tags.dat> stringid add Sandtrap_Metal_plate
Added string "Sandtrap_Metal_plate" as 0x00009231.

tags.dat> stringid add Sandtrap_Davinci_egg
Added string "Sandtrap_Davinci_egg" as 0x00009232.

tags.dat> 

tags.dat> stringid add sandtrap_warthog_1
Added string "sandtrap_warthog_1" as 0x00009233.

tags.dat> stringid add sandtrap_warthog_2
Added string "sandtrap_warthog_2" as 0x00009234.

tags.dat> stringid add sandtrap_warthog_3
Added string "sandtrap_warthog_3" as 0x00009235.

tags.dat> 

tags.dat> stringid add Guardian_GoldLift
Added string "Guardian_GoldLift" as 0x00009236.

tags.dat> stringid add Guardian_MancannonLift
Added string "Guardian_MancannonLift" as 0x00009237.

tags.dat> stringid add Guardian_Mancannonlift2
Added string "Guardian_Mancannonlift2" as 0x00009238.

tags.dat> stringid add Guardian_Mancannonlift3
Added string "Guardian_Mancannonlift3" as 0x00009239.

tags.dat> stringid add Guardian_Minilift
Added string "Guardian_Minilift" as 0x0000923A.

tags.dat> 

tags.dat> stringid add Diamondback_Gravitylift1
Added string "Diamondback_Gravitylift1" as 0x0000923B.

tags.dat> stringid add Diamondback_Gravitylift2
Added string "Diamondback_Gravitylift2" as 0x0000923C.

tags.dat> stringid add Diamondback_Gravitylift3
Added string "Diamondback_Gravitylift3" as 0x0000923D.

tags.dat> stringid add Diamondback_Gravitylift4
Added string "Diamondback_Gravitylift4" as 0x0000923E.

tags.dat> stringid add Diamondback_Gravitylift5
Added string "Diamondback_Gravitylift5" as 0x0000923F.

tags.dat> stringid add Diamondback_Gravitylift6
Added string "Diamondback_Gravitylift6" as 0x00009240.

tags.dat> 

tags.dat> 

tags.dat> stringid add turf_hornet
Added string "turf_hornet" as 0x00009241.

tags.dat> 

tags.dat> stringid add reactor_redlight
Added string "reactor_redlight" as 0x00009242.

tags.dat> stringid add reactor_bluelight
Added string "reactor_bluelight" as 0x00009243.

tags.dat> stringid add reactor_yellowlight
Added string "reactor_yellowlight" as 0x00009244.

tags.dat> stringid add reactor_pelican 
Added string "reactor_pelican" as 0x00009245.

tags.dat> 

tags.dat> stringid add Oddball
Added string "Oddball" as 0x00009246.

tags.dat> stringid add flag
Added string "flag" as 0x00009247.

tags.dat> stringid add Bomb
Added string "Bomb" as 0x00009248.

tags.dat> stringid add plasma_pistol_pwr
Added string "plasma_pistol_pwr" as 0x00009249.

tags.dat> stringid add plasma_rifle
Added string "plasma_rifle" as 0x0000924A.

tags.dat> stringid add plasma_riflev6
Added string "plasma_riflev6" as 0x0000924B.

tags.dat> stringid add assault_rifle_dmg
Added string "assault_rifle_dmg" as 0x0000924C.

tags.dat> stringid add assault_rifle_rof
Added string "assault_rifle_rof" as 0x0000924D.

tags.dat> stringid add assault_rifle_acc
Added string "assault_rifle_acc" as 0x0000924E.

tags.dat> stringid add assault_rifle_pwr
Added string "assault_rifle_pwr" as 0x0000924F.

tags.dat> stringid add battle_rifle_rof
Added string "battle_rifle_rof" as 0x00009250.

tags.dat> stringid add battle_rifle_acc
Added string "battle_rifle_acc" as 0x00009251.

tags.dat> stringid add battle_rifle_mag
Added string "battle_rifle_mag" as 0x00009252.

tags.dat> stringid add battle_rifle_dmg
Added string "battle_rifle_dmg" as 0x00009253.

tags.dat> stringid add battle_rifle_rng
Added string "battle_rifle_rng" as 0x00009254.

tags.dat> stringid add battle_rifle_pwr
Added string "battle_rifle_pwr" as 0x00009255.

tags.dat> stringid add dmr
Added string "dmr" as 0x00009256.

tags.dat> stringid add dmr_rng
Added string "dmr_rng" as 0x00009257.

tags.dat> stringid add dmr_acc
Added string "dmr_acc" as 0x00009258.

tags.dat> stringid add dmr_rof
Added string "dmr_rof" as 0x00009259.

tags.dat> stringid add dmr_dmg
Added string "dmr_dmg" as 0x0000925A.

tags.dat> stringid add dmr_mag
Added string "dmr_mag" as 0x0000925B.

tags.dat> stringid add dmr_pwr
Added string "dmr_pwr" as 0x0000925C.

tags.dat> stringid add carbine_rof
Added string "carbine_rof" as 0x0000925D.

tags.dat> stringid add carbine_mag
Added string "carbine_mag" as 0x0000925E.

tags.dat> stringid add carbine_rng
Added string "carbine_rng" as 0x0000925F.

tags.dat> stringid add carbine_dmg
Added string "carbine_dmg" as 0x00009260.

tags.dat> stringid add carbine_acc
Added string "carbine_acc" as 0x00009261.

tags.dat> stringid add carbine_pwr
Added string "carbine_pwr" as 0x00009262.

tags.dat> stringid add smg_rof
Added string "smg_rof" as 0x00009263.

tags.dat> stringid add smg_acc
Added string "smg_acc" as 0x00009264.

tags.dat> stringid add smg_dmg
Added string "smg_dmg" as 0x00009265.

tags.dat> stringid add smg_pwr
Added string "smg_pwr" as 0x00009266.

tags.dat> stringid add magnum_dmg
Added string "magnum_dmg" as 0x00009267.

tags.dat> stringid add magnum_pwr
Added string "magnum_pwr" as 0x00009268.

tags.dat> stringid add mauler_pwr
Added string "mauler_pwr" as 0x00009269.

tags.dat> 

tags.dat> stringid add BubbleShield
Added string "BubbleShield" as 0x0000926A.

tags.dat> stringid add DeployableCover
Added string "DeployableCover" as 0x0000926B.

tags.dat> stringid add PowerDrain
Added string "PowerDrain" as 0x0000926C.

tags.dat> stringid add radarjammer
Added string "radarjammer" as 0x0000926D.

tags.dat> stringid add Regen
Added string "Regen" as 0x0000926E.

tags.dat> stringid add flare
Added string "flare" as 0x0000926F.

tags.dat> stringid add tripmine
Added string "tripmine" as 0x00009270.

tags.dat> stringid add yellowpowerdrain
Added string "yellowpowerdrain" as 0x00009271.

tags.dat> stringid add scrambler
Added string "scrambler" as 0x00009272.

tags.dat> 

tags.dat> echo   add these new string_id's to tag 1221.multilingual_unicode_string_list. So they appear in the forge list.
add these new string_id's to tag 1221.multilingual_unicode_string_list. So they appear in the forge list. 
tags.dat> edit 1221
Tag 0x00001221.multilingual_unicode_string_list has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1221.multilingual_unicode_string_list> set english box_s "Box Small"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english box_m "Box Med"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english box_l "Box Large"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english box_xl "Box xLarge"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english box_xxl "Box xxLarge"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english wall_s "Wall Small"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english wall_m "Wall Med"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english wall_l "Wall Large"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english wall_xl "Wall xLarge"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english wall_xxl "Wall xxLarge"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english elephant "Elephant"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Gauss_Turret "Gauss turret"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Chaingun_Turret "Warthog turret"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Wraith_Turret "Wraith Turret"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english lastR_Bridge "Bridge *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english lastR_Barricade "Metal Barricade"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english lastR_Light "Light"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english lastR_Window "Window"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english lastR_Mascot "Mascot"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_controlpanel "Control Panel"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_metal "Metal"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_keyboard "Keyboard"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_pcmonitor "Monitor"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_filecabinet "File Cabinet"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_sfilecabinet "File Cabinet s"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_chair "Chair"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_gravlift "Gravity Lift *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_bird "Bird"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_bird2 "Bird 2"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_bird3 "Bird 3"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_camera "camera"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english pit_hornet "Hornet"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english narrows_gravlift "Gravity lift *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english narrows_core "power core"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_bunkerlid "Bunker Lid"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_chaingate "Chain gate"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_Cardboardbox "Cardboard box"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_CardboardboxOpen "Cardboard Box Open"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_Cboardboxrec "Cardboard box 2"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_Cboardbox2 "Cardboard Box 3"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_squaretable "Square table"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_chaingate2 "Chain gate 2"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Highground_ProwlerTurret "Prowler Turret"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_UsncMetal "Usnc Lid"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_GravityLift "Gravity lift *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_Barrel "Fancy Barrel"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_crowbar "Crowbar"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_Metal_plate "Metal plate"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Sandtrap_Davinci_egg "Da vinci egg"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english sandtrap_warthog_1 "Warthog troop"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english sandtrap_warthog_2 "Warthog civ"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english sandtrap_warthog_3 "Warthog destoryed"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english Guardian_GoldLift "Gold Lift"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Guardian_MancannonLift "Mancannon 1 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Guardian_Mancannonlift2 "ManCannon 2 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Guardian_Mancannonlift3 "ManCannon 3"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Guardian_Minilift "Minilift"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift1 "Gravitylift 1 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift2 "Gravitylift 2 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift3 "Gravitylift 3 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift4 "Gravitylift 4 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift5 "Gravitylift 5 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Diamondback_Gravitylift6 "Gravitylift 6 *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english reactor_redlight "Red light"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english reactor_bluelight "Blue light"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english reactor_yellowlight "Yellow Light"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english reactor_pelican "Pelican *"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> set english BubbleShield "Active Bubble Shield"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english DeployableCover "Active Deployable Cover"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english PowerDrain "Active Power Drain"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english Regen "Active Health Regen"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english radarjammer "Active Radar Jammer"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english flare "Active Flare"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english tripmine "Active Tripmine"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english yellowpowerdrain "Active Weapon Jammer"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> set english scrambler "AI Spawner ~"
String added successfully.

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> 

tags.dat\0x1221.multilingual_unicode_string_list> exitTo tags.dat

tags.dat> 

tags.dat> echo   edit the scnr of valhalla
edit the scnr of valhalla 
tags.dat> edit 3488
Tag 0x00003488.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3488.scenario> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> removefrom sandboxScenery 48 *
Invalid index specified: 48
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3488.scenario> addto sandboxScenery 10
Successfully added 10 elements to SandboxScenery: List`1<SandboxObject>
{...}[58]

tags.dat\0x3488.scenario> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x3488.scenario> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x3488.scenario> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x3488.scenario> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x3488.scenario> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x3488.scenario> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x3488.scenario> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x3488.scenario> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x3488.scenario> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x3488.scenario> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x3488.scenario> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x3488.scenario> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x3488.scenario> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x3488.scenario> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x3488.scenario> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x3488.scenario> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x3488.scenario> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x3488.scenario> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x3488.scenario> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> removefrom sandboxEquipment 15 *
Successfully removed 2 elements from SandboxEquipment at index 15: List`1<SandboxObject>
{...}[15]

tags.dat\0x3488.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x3488.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x3488.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x3488.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x3488.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x3488.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x3488.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x3488.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x3488.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x3488.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x3488.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x3488.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x3488.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x3488.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x3488.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x3488.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x3488.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x3488.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> removefrom SandboxWeapons 57 *
Invalid index specified: 57
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3488.scenario> addto SandboxWeapons 7
Successfully added 7 elements to SandboxWeapons: List`1<SandboxObject>
{...}[64]

tags.dat\0x3488.scenario> setfield SandboxWeapons[57].object 1525
Object: TagInstance = 0x00001525

tags.dat\0x3488.scenario> setfield SandboxWeapons[57].name plasma_rifle
Name: StringID = plasma_rifle

tags.dat\0x3488.scenario> setfield SandboxWeapons[58].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x3488.scenario> setfield SandboxWeapons[58].name flag
Name: StringID = flag

tags.dat\0x3488.scenario> setfield SandboxWeapons[59].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x3488.scenario> setfield SandboxWeapons[59].name Oddball
Name: StringID = Oddball

tags.dat\0x3488.scenario> setfield SandboxWeapons[60].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x3488.scenario> setfield SandboxWeapons[60].name Bomb
Name: StringID = Bomb

tags.dat\0x3488.scenario> setfield SandboxWeapons[61].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3488.scenario> setfield SandboxWeapons[61].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x3488.scenario> setfield SandboxWeapons[62].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x3488.scenario> setfield SandboxWeapons[62].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x3488.scenario> setfield SandboxWeapons[63].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3488.scenario> setfield SandboxWeapons[63].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3488.scenario> 

tags.dat\0x3488.scenario> savechanges
Done!

tags.dat\0x3488.scenario> exit

tags.dat> 

tags.dat> echo  changing the box objects so they are phased.
changing the box objects so they are phased. 
tags.dat> edit 3435
Tag 0x00003435.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3435.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3435.physics_model> savechanges
Done!

tags.dat\0x3435.physics_model> exit

tags.dat> 

tags.dat> edit 3439
Tag 0x00003439.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3439.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3439.physics_model> savechanges
Done!

tags.dat\0x3439.physics_model> exit

tags.dat> 

tags.dat> edit 343C
Tag 0x0000343C.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343C.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x343C.physics_model> savechanges
Done!

tags.dat\0x343C.physics_model> exit

tags.dat> 

tags.dat> edit 343F
Tag 0x0000343F.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343F.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x343F.physics_model> savechanges
Done!

tags.dat\0x343F.physics_model> exit

tags.dat> 

tags.dat> edit 3442
Tag 0x00003442.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3442.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3442.physics_model> savechanges
Done!

tags.dat\0x3442.physics_model> exit

tags.dat> 

tags.dat> echo  Changing the Wall objects so they are phased
Changing the Wall objects so they are phased 
tags.dat> edit 3445
Tag 0x00003445.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3445.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3445.physics_model> savechanges
Done!

tags.dat\0x3445.physics_model> exit

tags.dat> 

tags.dat> edit 3448
Tag 0x00003448.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3448.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3448.physics_model> savechanges
Done!

tags.dat\0x3448.physics_model> exit

tags.dat> 

tags.dat> edit 344B
Tag 0x0000344B.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344B.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x344B.physics_model> savechanges
Done!

tags.dat\0x344B.physics_model> exit

tags.dat> 

tags.dat> edit 344E
Tag 0x0000344E.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344E.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x344E.physics_model> savechanges
Done!

tags.dat\0x344E.physics_model> exit

tags.dat> 

tags.dat> edit 3451
Tag 0x00003451.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3451.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3451.physics_model> savechanges
Done!

tags.dat\0x3451.physics_model> exit

tags.dat> 

tags.dat> echo phasing vehicle turrets
phasing vehicle turrets 
tags.dat> 

tags.dat> edit 2A23
Tag 0x00002A23.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2A23.physics_model> setfield Rigidbodies[*].motiontype 2
MotionType: MotionTypeValue = Box

tags.dat\0x2A23.physics_model> savechanges
Done!

tags.dat\0x2A23.physics_model> exit

tags.dat> 

tags.dat> edit 2A07
Tag 0x00002A07.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2A07.physics_model> setfield Rigidbodies[*].motiontype 2
MotionType: MotionTypeValue = Box

tags.dat\0x2A07.physics_model> savechanges
Done!

tags.dat\0x2A07.physics_model> exit

tags.dat> 

tags.dat> edit 379D
Tag 0x0000379D.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x379D.physics_model> setfield Rigidbodies[*].motiontype 2
MotionType: MotionTypeValue = Box

tags.dat\0x379D.physics_model> savechanges
Done!

tags.dat\0x379D.physics_model> exit

tags.dat> 

tags.dat> edit 53A7
Tag 0x000053A7.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x53A7.physics_model> setfield Rigidbodies[*].motiontype 2
MotionType: MotionTypeValue = Box

tags.dat\0x53A7.physics_model> savechanges
Done!

tags.dat\0x53A7.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> echo Phasing objects on Pit
Phasing objects on Pit 
tags.dat> 

tags.dat> edit 470D
Tag 0x0000470D.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x470D.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x470D.physics_model> savechanges
Done!

tags.dat\0x470D.physics_model> exit

tags.dat> 

tags.dat> edit 461C
Tag 0x0000461C.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x461C.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x461C.physics_model> savechanges
Done!

tags.dat\0x461C.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> echo phasing objects on narrows
phasing objects on narrows 
tags.dat> 

tags.dat> edit 4B7A
Tag 0x00004B7A.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B7A.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4B7A.physics_model> savechanges
Done!

tags.dat\0x4B7A.physics_model> exit

tags.dat> 

tags.dat> echo phasing items on Last resort
phasing items on Last resort 
tags.dat> 

tags.dat> edit 51FE
Tag 0x000051FE.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51FE.model> setfield Rigidbodies[*].motiontype 4
Model does not contain a block named "Rigidbodies"
SetField: Sets the value of a specific field in the current Model definition.

Usage:
SetField <field name> <field value>

Use "help SetField" for more information.

tags.dat\0x51FE.model> savechanges
Done!

tags.dat\0x51FE.model> exit

tags.dat> 

tags.dat> edit 5219
Tag 0x00005219.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5219.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x5219.physics_model> savechanges
Done!

tags.dat\0x5219.physics_model> exit

tags.dat> 

tags.dat> echo Phasing items on High ground
Phasing items on High ground 
tags.dat> 

tags.dat> edit 54A6
Tag 0x000054A6.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54A6.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x54A6.physics_model> savechanges
Done!

tags.dat\0x54A6.physics_model> exit

tags.dat> 

tags.dat> edit 54DB
Tag 0x000054DB.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54DB.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x54DB.physics_model> savechanges
Done!

tags.dat\0x54DB.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> echo Phasing items on Guardian
Phasing items on Guardian 
tags.dat> 

tags.dat> edit 3425
Tag 0x00003425.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3425.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3425.physics_model> savechanges
Done!

tags.dat\0x3425.physics_model> exit

tags.dat> 

tags.dat> edit 342f
Tag 0x0000342F.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x342F.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x342F.physics_model> savechanges
Done!

tags.dat\0x342F.physics_model> exit

tags.dat> 

tags.dat> edit 3432
Tag 0x00003432.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3432.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3432.physics_model> savechanges
Done!

tags.dat\0x3432.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> phasing Items on Diamondback
Unrecognized command: phasing
Use "help" to list available commands.

tags.dat> 

tags.dat> edit 3C84
Tag 0x00003C84.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C84.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C84.physics_model> savechanges
Done!

tags.dat\0x3C84.physics_model> exit

tags.dat> 

tags.dat> edit 3C6F
Tag 0x00003C6F.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C6F.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C6F.physics_model> savechanges
Done!

tags.dat\0x3C6F.physics_model> exit

tags.dat> 

tags.dat> edit 3C61
Tag 0x00003C61.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C61.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C61.physics_model> savechanges
Done!

tags.dat\0x3C61.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of The Pit
edit the scnr of The Pit 
tags.dat> edit 4455
Tag 0x00004455.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4455.scenario> echo   This command "removefrom sandboxScenery 23 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 23 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4455.scenario> removefrom sandboxScenery 23 *
Invalid index specified: 23
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x4455.scenario> addto sandboxScenery 23
Successfully added 23 elements to SandboxScenery: List`1<SandboxObject>
{...}[46]

tags.dat\0x4455.scenario> setfield SandboxScenery[23].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4455.scenario> setfield SandboxScenery[24].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4455.scenario> setfield SandboxScenery[25].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4455.scenario> setfield SandboxScenery[26].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4455.scenario> setfield SandboxScenery[27].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4455.scenario> setfield SandboxScenery[28].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4455.scenario> setfield SandboxScenery[29].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4455.scenario> setfield SandboxScenery[30].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4455.scenario> setfield SandboxScenery[31].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4455.scenario> setfield SandboxScenery[32].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4455.scenario> setfield SandboxScenery[33].object 48EF
Object: TagInstance = 0x000048EF

tags.dat\0x4455.scenario> setfield SandboxScenery[34].object 4904
Object: TagInstance = 0x00004904

tags.dat\0x4455.scenario> setfield SandboxScenery[35].object 490E
Object: TagInstance = 0x0000490E

tags.dat\0x4455.scenario> setfield SandboxScenery[36].object 4918
Object: TagInstance = 0x00004918

tags.dat\0x4455.scenario> setfield SandboxScenery[37].object 4923
Object: TagInstance = 0x00004923

tags.dat\0x4455.scenario> setfield SandboxScenery[38].object 492F
Object: TagInstance = 0x0000492F

tags.dat\0x4455.scenario> setfield SandboxScenery[39].object 4934
Object: TagInstance = 0x00004934

tags.dat\0x4455.scenario> setfield SandboxScenery[40].object 4950
Object: TagInstance = 0x00004950

tags.dat\0x4455.scenario> setfield SandboxScenery[41].object 49B1
Object: TagInstance = 0x000049B1

tags.dat\0x4455.scenario> setfield SandboxScenery[42].object 49C3
Object: TagInstance = 0x000049C3

tags.dat\0x4455.scenario> setfield SandboxScenery[43].object 49DE
Object: TagInstance = 0x000049DE

tags.dat\0x4455.scenario> setfield SandboxScenery[44].object 4703
Object: TagInstance = 0x00004703

tags.dat\0x4455.scenario> setfield sandboxScenery[45].object 46CF
Object: TagInstance = 0x000046CF

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> setfield sandboxScenery[23].name box_s
Name: StringID = box_s

tags.dat\0x4455.scenario> setfield sandboxScenery[24].name box_m
Name: StringID = box_m

tags.dat\0x4455.scenario> setfield sandboxScenery[25].name box_l
Name: StringID = box_l

tags.dat\0x4455.scenario> setfield sandboxScenery[26].name box_xl
Name: StringID = box_xl

tags.dat\0x4455.scenario> setfield sandboxScenery[27].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4455.scenario> setfield sandboxScenery[28].name wall_s
Name: StringID = wall_s

tags.dat\0x4455.scenario> setfield sandboxScenery[29].name wall_m
Name: StringID = wall_m

tags.dat\0x4455.scenario> setfield sandboxScenery[30].name wall_l
Name: StringID = wall_l

tags.dat\0x4455.scenario> setfield sandboxScenery[31].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4455.scenario> setfield sandboxScenery[32].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4455.scenario> setfield SandboxScenery[33].name pit_controlpanel
Name: StringID = pit_controlpanel

tags.dat\0x4455.scenario> setfield SandboxScenery[34].name pit_metal
Name: StringID = pit_metal

tags.dat\0x4455.scenario> setfield SandboxScenery[35].name pit_keyboard
Name: StringID = pit_keyboard

tags.dat\0x4455.scenario> setfield SandboxScenery[36].name pit_pcmonitor 
Name: StringID = pit_pcmonitor

tags.dat\0x4455.scenario> setfield SandboxScenery[37].name pit_filecabinet 
Name: StringID = pit_filecabinet

tags.dat\0x4455.scenario> setfield SandboxScenery[38].name pit_sfilecabinet
Name: StringID = pit_sfilecabinet

tags.dat\0x4455.scenario> setfield SandboxScenery[39].name pit_chair 
Name: StringID = pit_chair

tags.dat\0x4455.scenario> setfield SandboxScenery[40].name pit_gravlift
Name: StringID = pit_gravlift

tags.dat\0x4455.scenario> setfield SandboxScenery[41].name pit_bird
Name: StringID = pit_bird

tags.dat\0x4455.scenario> setfield SandboxScenery[42].name pit_bird2
Name: StringID = pit_bird2

tags.dat\0x4455.scenario> setfield SandboxScenery[43].name pit_bird3
Name: StringID = pit_bird3

tags.dat\0x4455.scenario> setfield SandboxScenery[44].name pit_camera
Name: StringID = pit_camera

tags.dat\0x4455.scenario> setfield SandboxScenery[45].name pit_hornet
Name: StringID = pit_hornet

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4455.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x4455.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x4455.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x4455.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x4455.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x4455.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x4455.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x4455.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x4455.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x4455.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x4455.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x4455.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x4455.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x4455.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x4455.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x4455.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x4455.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x4455.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> removefrom SandboxWeapons 21 *
Invalid index specified: 21
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4455.scenario> addto SandboxWeapons 38
Successfully added 38 elements to SandboxWeapons: List`1<SandboxObject>
{...}[59]

tags.dat\0x4455.scenario> setfield SandboxWeapons[21].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x4455.scenario> setfield SandboxWeapons[21].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[22].object 1525
Object: TagInstance = 0x00001525

tags.dat\0x4455.scenario> setfield SandboxWeapons[22].name plasma_rifle
Name: StringID = plasma_rifle

tags.dat\0x4455.scenario> setfield SandboxWeapons[23].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x4455.scenario> setfield SandboxWeapons[23].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x4455.scenario> setfield SandboxWeapons[24].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x4455.scenario> setfield SandboxWeapons[24].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[25].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x4455.scenario> setfield SandboxWeapons[25].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x4455.scenario> setfield SandboxWeapons[26].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x4455.scenario> setfield SandboxWeapons[26].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x4455.scenario> setfield SandboxWeapons[27].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x4455.scenario> setfield SandboxWeapons[27].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[28].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x4455.scenario> setfield SandboxWeapons[28].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x4455.scenario> setfield SandboxWeapons[29].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x4455.scenario> setfield SandboxWeapons[29].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x4455.scenario> setfield SandboxWeapons[30].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x4455.scenario> setfield SandboxWeapons[30].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x4455.scenario> setfield SandboxWeapons[31].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x4455.scenario> setfield SandboxWeapons[31].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[32].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x4455.scenario> setfield SandboxWeapons[32].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x4455.scenario> setfield SandboxWeapons[33].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x4455.scenario> setfield SandboxWeapons[33].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[34].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x4455.scenario> setfield SandboxWeapons[34].name dmr
Name: StringID = dmr

tags.dat\0x4455.scenario> setfield SandboxWeapons[35].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x4455.scenario> setfield SandboxWeapons[35].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x4455.scenario> setfield SandboxWeapons[36].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x4455.scenario> setfield SandboxWeapons[36].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x4455.scenario> setfield SandboxWeapons[37].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x4455.scenario> setfield SandboxWeapons[37].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x4455.scenario> setfield SandboxWeapons[38].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x4455.scenario> setfield SandboxWeapons[38].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[39].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x4455.scenario> setfield SandboxWeapons[39].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x4455.scenario> setfield SandboxWeapons[40].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x4455.scenario> setfield SandboxWeapons[40].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[41].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x4455.scenario> setfield SandboxWeapons[41].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x4455.scenario> setfield SandboxWeapons[42].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x4455.scenario> setfield SandboxWeapons[42].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x4455.scenario> setfield SandboxWeapons[43].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x4455.scenario> setfield SandboxWeapons[43].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x4455.scenario> setfield SandboxWeapons[44].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x4455.scenario> setfield SandboxWeapons[44].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[45].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x4455.scenario> setfield SandboxWeapons[45].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x4455.scenario> setfield SandboxWeapons[46].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x4455.scenario> setfield SandboxWeapons[46].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[47].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x4455.scenario> setfield SandboxWeapons[47].name smg_rof
Name: StringID = smg_rof

tags.dat\0x4455.scenario> setfield SandboxWeapons[48].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x4455.scenario> setfield SandboxWeapons[48].name smg_acc
Name: StringID = smg_acc

tags.dat\0x4455.scenario> setfield SandboxWeapons[49].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x4455.scenario> setfield SandboxWeapons[49].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[50].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x4455.scenario> setfield SandboxWeapons[50].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[51].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x4455.scenario> setfield SandboxWeapons[51].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x4455.scenario> setfield SandboxWeapons[52].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x4455.scenario> setfield SandboxWeapons[52].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[53].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x4455.scenario> setfield SandboxWeapons[53].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x4455.scenario> setfield SandboxWeapons[54].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4455.scenario> setfield SandboxWeapons[54].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x4455.scenario> setfield SandboxWeapons[55].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4455.scenario> setfield SandboxWeapons[55].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4455.scenario> setfield SandboxWeapons[56].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x4455.scenario> setfield SandboxWeapons[56].name flag
Name: StringID = flag

tags.dat\0x4455.scenario> setfield SandboxWeapons[57].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x4455.scenario> setfield SandboxWeapons[57].name Oddball
Name: StringID = Oddball

tags.dat\0x4455.scenario> setfield SandboxWeapons[58].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x4455.scenario> setfield SandboxWeapons[58].name Bomb
Name: StringID = Bomb

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> echo  maxing forge pallete for Pit
maxing forge pallete for Pit 
tags.dat\0x4455.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> 

tags.dat\0x4455.scenario> savechanges
Done!

tags.dat\0x4455.scenario> exit

tags.dat> 

tags.dat> echo   edit the scnr of Narrows
edit the scnr of Narrows 
tags.dat> edit 4A08
Tag 0x00004A08.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> removefrom sandboxScenery 19 *
Invalid index specified: 19
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> addto sandboxScenery 11
Successfully added 11 elements to SandboxScenery: List`1<SandboxObject>
{...}[30]

tags.dat\0x4A08.scenario> setfield SandboxScenery[19].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4A08.scenario> setfield SandboxScenery[20].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4A08.scenario> setfield SandboxScenery[21].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4A08.scenario> setfield SandboxScenery[22].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4A08.scenario> setfield SandboxScenery[23].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4A08.scenario> setfield SandboxScenery[24].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4A08.scenario> setfield SandboxScenery[25].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4A08.scenario> setfield SandboxScenery[26].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4A08.scenario> setfield SandboxScenery[27].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4A08.scenario> setfield SandboxScenery[28].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4A08.scenario> setfield SandboxScenery[29].object 4BC8
Object: TagInstance = 0x00004BC8

tags.dat\0x4A08.scenario> setfield sandboxScenery[19].name box_s
Name: StringID = box_s

tags.dat\0x4A08.scenario> setfield sandboxScenery[20].name box_m
Name: StringID = box_m

tags.dat\0x4A08.scenario> setfield sandboxScenery[21].name box_l
Name: StringID = box_l

tags.dat\0x4A08.scenario> setfield sandboxScenery[22].name box_xl
Name: StringID = box_xl

tags.dat\0x4A08.scenario> setfield sandboxScenery[23].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4A08.scenario> setfield sandboxScenery[24].name wall_s
Name: StringID = wall_s

tags.dat\0x4A08.scenario> setfield sandboxScenery[25].name wall_m
Name: StringID = wall_m

tags.dat\0x4A08.scenario> setfield sandboxScenery[26].name wall_l
Name: StringID = wall_l

tags.dat\0x4A08.scenario> setfield sandboxScenery[27].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4A08.scenario> setfield sandboxScenery[28].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4A08.scenario> setfield SandboxScenery[29].name narrows_gravlift
Name: StringID = narrows_gravlift

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> removefrom sandboxVehicles 2 *
Invalid index specified: 2
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4A08.scenario> addto sandboxVehicles 2
Successfully added 2 elements to SandboxVehicles: List`1<SandboxObject>
{...}[4]

tags.dat\0x4A08.scenario> setfield SandboxVehicles[2].object 1598
Object: TagInstance = 0x00001598

tags.dat\0x4A08.scenario> setfield SandboxVehicles[2].name hornet
Name: StringID = hornet

tags.dat\0x4A08.scenario> setfield SandboxVehicles[3].object 151A
Object: TagInstance = 0x0000151A

tags.dat\0x4A08.scenario> setfield SandboxVehicles[3].name banshee
Name: StringID = banshee

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4A08.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x4A08.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x4A08.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x4A08.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x4A08.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x4A08.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x4A08.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x4A08.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x4A08.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x4A08.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x4A08.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x4A08.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x4A08.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x4A08.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x4A08.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x4A08.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x4A08.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x4A08.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> removefrom SandboxWeapons 22 *
Invalid index specified: 22
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4A08.scenario> addto SandboxWeapons 37
Successfully added 37 elements to SandboxWeapons: List`1<SandboxObject>
{...}[59]

tags.dat\0x4A08.scenario> setfield SandboxWeapons[22].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x4A08.scenario> setfield SandboxWeapons[22].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[23].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x4A08.scenario> setfield SandboxWeapons[23].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x4A08.scenario> setfield SandboxWeapons[24].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x4A08.scenario> setfield SandboxWeapons[24].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[25].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x4A08.scenario> setfield SandboxWeapons[25].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x4A08.scenario> setfield SandboxWeapons[26].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x4A08.scenario> setfield SandboxWeapons[26].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x4A08.scenario> setfield SandboxWeapons[27].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x4A08.scenario> setfield SandboxWeapons[27].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[28].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x4A08.scenario> setfield SandboxWeapons[28].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x4A08.scenario> setfield SandboxWeapons[29].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x4A08.scenario> setfield SandboxWeapons[29].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x4A08.scenario> setfield SandboxWeapons[30].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x4A08.scenario> setfield SandboxWeapons[30].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x4A08.scenario> setfield SandboxWeapons[31].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x4A08.scenario> setfield SandboxWeapons[31].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[32].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x4A08.scenario> setfield SandboxWeapons[32].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x4A08.scenario> setfield SandboxWeapons[33].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x4A08.scenario> setfield SandboxWeapons[33].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[34].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x4A08.scenario> setfield SandboxWeapons[34].name dmr
Name: StringID = dmr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[35].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x4A08.scenario> setfield SandboxWeapons[35].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x4A08.scenario> setfield SandboxWeapons[36].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x4A08.scenario> setfield SandboxWeapons[36].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x4A08.scenario> setfield SandboxWeapons[37].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x4A08.scenario> setfield SandboxWeapons[37].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x4A08.scenario> setfield SandboxWeapons[38].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x4A08.scenario> setfield SandboxWeapons[38].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[39].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x4A08.scenario> setfield SandboxWeapons[39].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x4A08.scenario> setfield SandboxWeapons[40].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x4A08.scenario> setfield SandboxWeapons[40].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[41].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x4A08.scenario> setfield SandboxWeapons[41].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x4A08.scenario> setfield SandboxWeapons[42].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x4A08.scenario> setfield SandboxWeapons[42].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x4A08.scenario> setfield SandboxWeapons[43].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x4A08.scenario> setfield SandboxWeapons[43].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x4A08.scenario> setfield SandboxWeapons[44].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x4A08.scenario> setfield SandboxWeapons[44].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[45].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x4A08.scenario> setfield SandboxWeapons[45].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x4A08.scenario> setfield SandboxWeapons[46].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x4A08.scenario> setfield SandboxWeapons[46].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[47].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x4A08.scenario> setfield SandboxWeapons[47].name smg_rof
Name: StringID = smg_rof

tags.dat\0x4A08.scenario> setfield SandboxWeapons[48].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x4A08.scenario> setfield SandboxWeapons[48].name smg_acc
Name: StringID = smg_acc

tags.dat\0x4A08.scenario> setfield SandboxWeapons[49].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x4A08.scenario> setfield SandboxWeapons[49].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[50].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x4A08.scenario> setfield SandboxWeapons[50].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[51].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x4A08.scenario> setfield SandboxWeapons[51].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x4A08.scenario> setfield SandboxWeapons[52].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x4A08.scenario> setfield SandboxWeapons[52].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[53].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x4A08.scenario> setfield SandboxWeapons[53].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x4A08.scenario> setfield SandboxWeapons[54].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4A08.scenario> setfield SandboxWeapons[54].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x4A08.scenario> setfield SandboxWeapons[55].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4A08.scenario> setfield SandboxWeapons[55].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4A08.scenario> setfield SandboxWeapons[56].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x4A08.scenario> setfield SandboxWeapons[56].name flag
Name: StringID = flag

tags.dat\0x4A08.scenario> setfield SandboxWeapons[57].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x4A08.scenario> setfield SandboxWeapons[57].name Oddball
Name: StringID = Oddball

tags.dat\0x4A08.scenario> setfield SandboxWeapons[58].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x4A08.scenario> setfield SandboxWeapons[58].name Bomb
Name: StringID = Bomb

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> echo  maxing forge pallete for Narrows
maxing forge pallete for Narrows 
tags.dat\0x4A08.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.scenario> 

tags.dat\0x4A08.scenario> savechanges
Done!

tags.dat\0x4A08.scenario> exit

tags.dat> 

tags.dat> echo   edit the scnr of Standoff
edit the scnr of Standoff 
tags.dat> edit 4BD7
Tag 0x00004BD7.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4BD7.scenario> echo   This command "removefrom sandboxScenery 30 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 30 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4BD7.scenario> removefrom sandboxScenery 30 *
Invalid index specified: 30
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> echo  Adds 13 entrys to the scenery forge menu
Adds 13 entrys to the scenery forge menu 
tags.dat\0x4BD7.scenario> addto sandboxScenery 10
Successfully added 10 elements to SandboxScenery: List`1<SandboxObject>
{...}[40]

tags.dat\0x4BD7.scenario> setfield SandboxScenery[30].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4BD7.scenario> setfield SandboxScenery[31].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4BD7.scenario> setfield SandboxScenery[32].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4BD7.scenario> setfield SandboxScenery[33].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4BD7.scenario> setfield SandboxScenery[34].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4BD7.scenario> setfield SandboxScenery[35].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4BD7.scenario> setfield SandboxScenery[36].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4BD7.scenario> setfield SandboxScenery[37].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4BD7.scenario> setfield SandboxScenery[38].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4BD7.scenario> setfield SandboxScenery[39].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxScenery[30].name box_s
Name: StringID = box_s

tags.dat\0x4BD7.scenario> setfield sandboxScenery[31].name box_m
Name: StringID = box_m

tags.dat\0x4BD7.scenario> setfield sandboxScenery[32].name box_l
Name: StringID = box_l

tags.dat\0x4BD7.scenario> setfield sandboxScenery[33].name box_xl
Name: StringID = box_xl

tags.dat\0x4BD7.scenario> setfield sandboxScenery[34].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4BD7.scenario> setfield sandboxScenery[35].name wall_s
Name: StringID = wall_s

tags.dat\0x4BD7.scenario> setfield sandboxScenery[36].name wall_m
Name: StringID = wall_m

tags.dat\0x4BD7.scenario> setfield sandboxScenery[37].name wall_l
Name: StringID = wall_l

tags.dat\0x4BD7.scenario> setfield sandboxScenery[38].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4BD7.scenario> setfield sandboxScenery[39].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> removefrom SandboxVehicles 6 *
Successfully removed 1 element from SandboxVehicles at index 6: List`1<SandboxObject>
{...}[6]

tags.dat\0x4BD7.scenario> addto SandboxVehicles 4
Successfully added 4 elements to SandboxVehicles: List`1<SandboxObject>
{...}[10]

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[6].object 4441
Object: TagInstance = 0x00004441

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[7].object 4442
Object: TagInstance = 0x00004442

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[8].object 4443
Object: TagInstance = 0x00004443

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[9].object 4447
Object: TagInstance = 0x00004447

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[6].name warthog_gauss
Name: StringID = warthog_gauss

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[7].name sandtrap_warthog_1
Name: StringID = sandtrap_warthog_1

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[8].name sandtrap_warthog_2
Name: StringID = sandtrap_warthog_2

tags.dat\0x4BD7.scenario> setfield SandboxVehicles[9].name sandtrap_warthog_3
Name: StringID = sandtrap_warthog_3

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> removefrom SandboxWeapons 23 *
Invalid index specified: 23
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4BD7.scenario> addto SandboxWeapons 39
Successfully added 39 elements to SandboxWeapons: List`1<SandboxObject>
{...}[62]

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[23].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[23].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[24].object 1525
Object: TagInstance = 0x00001525

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[24].name plasma_rifle
Name: StringID = plasma_rifle

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[25].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[25].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[26].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[26].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[27].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[27].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[28].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[28].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[29].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[29].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[30].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[30].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[31].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[31].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[32].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[32].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[33].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[33].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[34].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[34].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[35].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[35].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[36].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[36].name dmr
Name: StringID = dmr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[37].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[37].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[38].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[38].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[39].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[39].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[40].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[40].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[41].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[41].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[42].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[42].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[43].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[43].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[44].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[44].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[45].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[45].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[46].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[46].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[47].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[47].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[48].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[48].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[49].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[49].name smg_rof
Name: StringID = smg_rof

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[50].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[50].name smg_acc
Name: StringID = smg_acc

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[51].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[51].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[52].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[52].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[53].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[53].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[54].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[54].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[55].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[55].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[56].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[56].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[57].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[57].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[58].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[58].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[59].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[59].name flag
Name: StringID = flag

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[60].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[60].name Oddball
Name: StringID = Oddball

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[61].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x4BD7.scenario> setfield SandboxWeapons[61].name Bomb
Name: StringID = Bomb

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4BD7.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x4BD7.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> echo  maxing forge pallete for Standoff
maxing forge pallete for Standoff 
tags.dat\0x4BD7.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[23].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[24].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[25].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[26].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[27].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[28].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxScenery[29].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxWeapons[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.scenario> 

tags.dat\0x4BD7.scenario> savechanges
Done!

tags.dat\0x4BD7.scenario> exit

tags.dat> 

tags.dat> echo  Phasing Standoff Objects
Phasing Standoff Objects 
tags.dat> edit 4DF7
Tag 0x00004DF7.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4DF7.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4DF7.physics_model> savechanges
Done!

tags.dat\0x4DF7.physics_model> exit

tags.dat> 

tags.dat> edit 4E1F
Tag 0x00004E1F.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E1F.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E1F.physics_model> savechanges
Done!

tags.dat\0x4E1F.physics_model> exit

tags.dat> 

tags.dat> edit 4E2A
Tag 0x00004E2A.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E2A.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E2A.physics_model> savechanges
Done!

tags.dat\0x4E2A.physics_model> exit

tags.dat> 

tags.dat> edit 4E52
Tag 0x00004E52.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E52.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E52.physics_model> savechanges
Done!

tags.dat\0x4E52.physics_model> exit

tags.dat> 

tags.dat> edit 4E3B
Tag 0x00004E3B.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E3B.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E3B.physics_model> savechanges
Done!

tags.dat\0x4E3B.physics_model> exit

tags.dat> 

tags.dat> edit 4E45
Tag 0x00004E45.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E45.physics_model> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E45.physics_model> savechanges
Done!

tags.dat\0x4E45.physics_model> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of Last resort
edit the scnr of Last resort 
tags.dat> edit 4F14
Tag 0x00004F14.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F14.scenario> echo   This command "removefrom sandboxScenery 21 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 21 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4F14.scenario> removefrom sandboxScenery 21 *
Invalid index specified: 21
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x4F14.scenario> removefrom SandboxVehicles 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F14.scenario> addto SandboxVehicles 3
Successfully added 3 elements to SandboxVehicles: List`1<SandboxObject>
{...}[8]

tags.dat\0x4F14.scenario> setfield SandboxVehicles[5].object 4442
Object: TagInstance = 0x00004442

tags.dat\0x4F14.scenario> setfield SandboxVehicles[6].object 4443
Object: TagInstance = 0x00004443

tags.dat\0x4F14.scenario> setfield SandboxVehicles[7].object 4447
Object: TagInstance = 0x00004447

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> setfield SandboxVehicles[5].name sandtrap_warthog_1
Name: StringID = sandtrap_warthog_1

tags.dat\0x4F14.scenario> setfield SandboxVehicles[6].name sandtrap_warthog_2
Name: StringID = sandtrap_warthog_2

tags.dat\0x4F14.scenario> setfield SandboxVehicles[7].name sandtrap_warthog_3
Name: StringID = sandtrap_warthog_3

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> addto sandboxScenery 15
Successfully added 15 elements to SandboxScenery: List`1<SandboxObject>
{...}[36]

tags.dat\0x4F14.scenario> setfield SandboxScenery[21].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4F14.scenario> setfield SandboxScenery[22].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4F14.scenario> setfield SandboxScenery[23].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4F14.scenario> setfield SandboxScenery[24].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4F14.scenario> setfield SandboxScenery[25].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4F14.scenario> setfield SandboxScenery[26].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4F14.scenario> setfield SandboxScenery[27].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4F14.scenario> setfield SandboxScenery[28].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4F14.scenario> setfield SandboxScenery[29].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4F14.scenario> setfield SandboxScenery[30].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4F14.scenario> setfield SandboxScenery[31].object 51C7
Object: TagInstance = 0x000051C7

tags.dat\0x4F14.scenario> setfield SandboxScenery[32].object 5210
Object: TagInstance = 0x00005210

tags.dat\0x4F14.scenario> setfield SandboxScenery[33].object 51FD
Object: TagInstance = 0x000051FD

tags.dat\0x4F14.scenario> setfield SandboxScenery[34].object 51EA
Object: TagInstance = 0x000051EA

tags.dat\0x4F14.scenario> setfield SandboxScenery[35].object 5239
Object: TagInstance = 0x00005239

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> setfield sandboxScenery[21].name box_s
Name: StringID = box_s

tags.dat\0x4F14.scenario> setfield sandboxScenery[22].name box_m
Name: StringID = box_m

tags.dat\0x4F14.scenario> setfield sandboxScenery[23].name box_l
Name: StringID = box_l

tags.dat\0x4F14.scenario> setfield sandboxScenery[24].name box_xl
Name: StringID = box_xl

tags.dat\0x4F14.scenario> setfield sandboxScenery[25].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4F14.scenario> setfield sandboxScenery[26].name wall_s
Name: StringID = wall_s

tags.dat\0x4F14.scenario> setfield sandboxScenery[27].name wall_m
Name: StringID = wall_m

tags.dat\0x4F14.scenario> setfield sandboxScenery[28].name wall_l
Name: StringID = wall_l

tags.dat\0x4F14.scenario> setfield sandboxScenery[29].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4F14.scenario> setfield sandboxScenery[30].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4F14.scenario> setfield SandboxScenery[31].name lastR_Bridge
Name: StringID = lastR_Bridge

tags.dat\0x4F14.scenario> setfield SandboxScenery[32].name lastR_Barricade
Name: StringID = lastR_Barricade

tags.dat\0x4F14.scenario> setfield SandboxScenery[33].name lastR_Light
Name: StringID = lastR_Light

tags.dat\0x4F14.scenario> setfield SandboxScenery[34].name lastR_Window
Name: StringID = lastR_Window

tags.dat\0x4F14.scenario> setfield SandboxScenery[35].name lastR_Mascot
Name: StringID = lastR_Mascot

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> removefrom SandboxWeapons 18 *
Invalid index specified: 18
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F14.scenario> addto SandboxWeapons 37
Successfully added 37 elements to SandboxWeapons: List`1<SandboxObject>
{...}[55]

tags.dat\0x4F14.scenario> setfield SandboxWeapons[18].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x4F14.scenario> setfield SandboxWeapons[18].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[19].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x4F14.scenario> setfield SandboxWeapons[19].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x4F14.scenario> setfield SandboxWeapons[20].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x4F14.scenario> setfield SandboxWeapons[20].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[21].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x4F14.scenario> setfield SandboxWeapons[21].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x4F14.scenario> setfield SandboxWeapons[22].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x4F14.scenario> setfield SandboxWeapons[22].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x4F14.scenario> setfield SandboxWeapons[23].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x4F14.scenario> setfield SandboxWeapons[23].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[24].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x4F14.scenario> setfield SandboxWeapons[24].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x4F14.scenario> setfield SandboxWeapons[25].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x4F14.scenario> setfield SandboxWeapons[25].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x4F14.scenario> setfield SandboxWeapons[26].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x4F14.scenario> setfield SandboxWeapons[26].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x4F14.scenario> setfield SandboxWeapons[27].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x4F14.scenario> setfield SandboxWeapons[27].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[28].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x4F14.scenario> setfield SandboxWeapons[28].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x4F14.scenario> setfield SandboxWeapons[29].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x4F14.scenario> setfield SandboxWeapons[29].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[30].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x4F14.scenario> setfield SandboxWeapons[30].name dmr
Name: StringID = dmr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[31].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x4F14.scenario> setfield SandboxWeapons[31].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x4F14.scenario> setfield SandboxWeapons[32].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x4F14.scenario> setfield SandboxWeapons[32].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x4F14.scenario> setfield SandboxWeapons[33].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x4F14.scenario> setfield SandboxWeapons[33].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x4F14.scenario> setfield SandboxWeapons[34].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x4F14.scenario> setfield SandboxWeapons[34].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[35].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x4F14.scenario> setfield SandboxWeapons[35].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x4F14.scenario> setfield SandboxWeapons[36].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x4F14.scenario> setfield SandboxWeapons[36].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[37].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x4F14.scenario> setfield SandboxWeapons[37].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x4F14.scenario> setfield SandboxWeapons[38].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x4F14.scenario> setfield SandboxWeapons[38].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x4F14.scenario> setfield SandboxWeapons[39].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x4F14.scenario> setfield SandboxWeapons[39].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x4F14.scenario> setfield SandboxWeapons[40].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x4F14.scenario> setfield SandboxWeapons[40].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[41].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x4F14.scenario> setfield SandboxWeapons[41].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x4F14.scenario> setfield SandboxWeapons[42].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x4F14.scenario> setfield SandboxWeapons[42].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[43].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x4F14.scenario> setfield SandboxWeapons[43].name smg_rof
Name: StringID = smg_rof

tags.dat\0x4F14.scenario> setfield SandboxWeapons[44].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x4F14.scenario> setfield SandboxWeapons[44].name smg_acc
Name: StringID = smg_acc

tags.dat\0x4F14.scenario> setfield SandboxWeapons[45].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x4F14.scenario> setfield SandboxWeapons[45].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[46].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x4F14.scenario> setfield SandboxWeapons[46].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[47].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x4F14.scenario> setfield SandboxWeapons[47].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x4F14.scenario> setfield SandboxWeapons[48].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x4F14.scenario> setfield SandboxWeapons[48].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[49].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x4F14.scenario> setfield SandboxWeapons[49].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x4F14.scenario> setfield SandboxWeapons[50].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4F14.scenario> setfield SandboxWeapons[50].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x4F14.scenario> setfield SandboxWeapons[51].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4F14.scenario> setfield SandboxWeapons[51].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4F14.scenario> setfield SandboxWeapons[52].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x4F14.scenario> setfield SandboxWeapons[52].name flag
Name: StringID = flag

tags.dat\0x4F14.scenario> setfield SandboxWeapons[53].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x4F14.scenario> setfield SandboxWeapons[53].name Oddball
Name: StringID = Oddball

tags.dat\0x4F14.scenario> setfield SandboxWeapons[54].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x4F14.scenario> setfield SandboxWeapons[54].name Bomb
Name: StringID = Bomb

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F14.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x4F14.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x4F14.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x4F14.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x4F14.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x4F14.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x4F14.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x4F14.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x4F14.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x4F14.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x4F14.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x4F14.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x4F14.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x4F14.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x4F14.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x4F14.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x4F14.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x4F14.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> echo  maxing forge pallete for last resort
maxing forge pallete for last resort 
tags.dat\0x4F14.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> 

tags.dat\0x4F14.scenario> savechanges
Done!

tags.dat\0x4F14.scenario> exit

tags.dat> 

tags.dat> echo   edit the scnr of High Ground
edit the scnr of High Ground 
tags.dat> edit 5247
Tag 0x00005247.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5247.scenario> echo   This command "removefrom sandboxScenery 31 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 31 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x5247.scenario> removefrom sandboxScenery 31 *
Invalid index specified: 31
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x5247.scenario> addto sandboxScenery 17
Successfully added 17 elements to SandboxScenery: List`1<SandboxObject>
{...}[48]

tags.dat\0x5247.scenario> setfield SandboxScenery[31].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x5247.scenario> setfield SandboxScenery[32].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x5247.scenario> setfield SandboxScenery[33].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x5247.scenario> setfield SandboxScenery[34].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x5247.scenario> setfield SandboxScenery[35].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x5247.scenario> setfield SandboxScenery[36].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x5247.scenario> setfield SandboxScenery[37].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x5247.scenario> setfield SandboxScenery[38].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x5247.scenario> setfield SandboxScenery[39].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x5247.scenario> setfield SandboxScenery[40].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x5247.scenario> setfield SandboxScenery[41].object 5495
Object: TagInstance = 0x00005495

tags.dat\0x5247.scenario> setfield SandboxScenery[42].object 54A2
Object: TagInstance = 0x000054A2

tags.dat\0x5247.scenario> setfield SandboxScenery[43].object 54AB
Object: TagInstance = 0x000054AB

tags.dat\0x5247.scenario> setfield SandboxScenery[44].object 54C7
Object: TagInstance = 0x000054C7

tags.dat\0x5247.scenario> setfield SandboxScenery[45].object 54CC
Object: TagInstance = 0x000054CC

tags.dat\0x5247.scenario> setfield SandboxScenery[46].object 54D1
Object: TagInstance = 0x000054D1

tags.dat\0x5247.scenario> setfield SandboxScenery[47].object 54D7
Object: TagInstance = 0x000054D7

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> setfield sandboxScenery[31].name box_s
Name: StringID = box_s

tags.dat\0x5247.scenario> setfield sandboxScenery[32].name box_m
Name: StringID = box_m

tags.dat\0x5247.scenario> setfield sandboxScenery[33].name box_l
Name: StringID = box_l

tags.dat\0x5247.scenario> setfield sandboxScenery[34].name box_xl
Name: StringID = box_xl

tags.dat\0x5247.scenario> setfield sandboxScenery[35].name box_xxl
Name: StringID = box_xxl

tags.dat\0x5247.scenario> setfield sandboxScenery[36].name wall_s
Name: StringID = wall_s

tags.dat\0x5247.scenario> setfield sandboxScenery[37].name wall_m
Name: StringID = wall_m

tags.dat\0x5247.scenario> setfield sandboxScenery[38].name wall_l
Name: StringID = wall_l

tags.dat\0x5247.scenario> setfield sandboxScenery[39].name wall_xl
Name: StringID = wall_xl

tags.dat\0x5247.scenario> setfield sandboxScenery[40].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x5247.scenario> setfield sandboxScenery[41].name Highground_bunkerlid
Name: StringID = Highground_bunkerlid

tags.dat\0x5247.scenario> setfield sandboxScenery[42].name Highground_chaingate
Name: StringID = Highground_chaingate

tags.dat\0x5247.scenario> setfield sandboxScenery[43].name Highground_Cardboardbox
Name: StringID = Highground_Cardboardbox

tags.dat\0x5247.scenario> setfield sandboxScenery[44].name Highground_Cboardboxrec
Name: StringID = Highground_Cboardboxrec

tags.dat\0x5247.scenario> setfield sandboxScenery[45].name Highground_Cboardbox2 
Name: StringID = Highground_Cboardbox2

tags.dat\0x5247.scenario> setfield SandboxScenery[46].name Highground_squaretable
Name: StringID = Highground_squaretable

tags.dat\0x5247.scenario> setfield SandboxScenery[47].name Highground_chaingate2
Name: StringID = Highground_chaingate2

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> removefrom SandboxWeapons 22 *
Invalid index specified: 22
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5247.scenario> addto SandboxWeapons 40
Successfully added 40 elements to SandboxWeapons: List`1<SandboxObject>
{...}[62]

tags.dat\0x5247.scenario> setfield SandboxWeapons[22].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x5247.scenario> setfield SandboxWeapons[22].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[23].object 1525
Object: TagInstance = 0x00001525

tags.dat\0x5247.scenario> setfield SandboxWeapons[23].name plasma_rifle
Name: StringID = plasma_rifle

tags.dat\0x5247.scenario> setfield SandboxWeapons[24].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x5247.scenario> setfield SandboxWeapons[24].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x5247.scenario> setfield SandboxWeapons[25].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x5247.scenario> setfield SandboxWeapons[25].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[26].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x5247.scenario> setfield SandboxWeapons[26].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x5247.scenario> setfield SandboxWeapons[27].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x5247.scenario> setfield SandboxWeapons[27].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x5247.scenario> setfield SandboxWeapons[28].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x5247.scenario> setfield SandboxWeapons[28].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[29].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x5247.scenario> setfield SandboxWeapons[29].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x5247.scenario> setfield SandboxWeapons[30].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x5247.scenario> setfield SandboxWeapons[30].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x5247.scenario> setfield SandboxWeapons[31].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x5247.scenario> setfield SandboxWeapons[31].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x5247.scenario> setfield SandboxWeapons[32].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x5247.scenario> setfield SandboxWeapons[32].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[33].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x5247.scenario> setfield SandboxWeapons[33].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x5247.scenario> setfield SandboxWeapons[34].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x5247.scenario> setfield SandboxWeapons[34].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[35].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x5247.scenario> setfield SandboxWeapons[35].name dmr
Name: StringID = dmr

tags.dat\0x5247.scenario> setfield SandboxWeapons[36].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x5247.scenario> setfield SandboxWeapons[36].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x5247.scenario> setfield SandboxWeapons[37].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x5247.scenario> setfield SandboxWeapons[37].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x5247.scenario> setfield SandboxWeapons[38].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x5247.scenario> setfield SandboxWeapons[38].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x5247.scenario> setfield SandboxWeapons[39].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x5247.scenario> setfield SandboxWeapons[39].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[40].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x5247.scenario> setfield SandboxWeapons[40].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x5247.scenario> setfield SandboxWeapons[41].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x5247.scenario> setfield SandboxWeapons[41].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[42].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x5247.scenario> setfield SandboxWeapons[42].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x5247.scenario> setfield SandboxWeapons[43].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x5247.scenario> setfield SandboxWeapons[43].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x5247.scenario> setfield SandboxWeapons[44].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x5247.scenario> setfield SandboxWeapons[44].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x5247.scenario> setfield SandboxWeapons[45].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x5247.scenario> setfield SandboxWeapons[45].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[46].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x5247.scenario> setfield SandboxWeapons[46].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x5247.scenario> setfield SandboxWeapons[47].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x5247.scenario> setfield SandboxWeapons[47].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[48].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x5247.scenario> setfield SandboxWeapons[48].name smg_rof
Name: StringID = smg_rof

tags.dat\0x5247.scenario> setfield SandboxWeapons[49].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x5247.scenario> setfield SandboxWeapons[49].name smg_acc
Name: StringID = smg_acc

tags.dat\0x5247.scenario> setfield SandboxWeapons[50].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x5247.scenario> setfield SandboxWeapons[50].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[51].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x5247.scenario> setfield SandboxWeapons[51].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[52].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x5247.scenario> setfield SandboxWeapons[52].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x5247.scenario> setfield SandboxWeapons[53].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x5247.scenario> setfield SandboxWeapons[53].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[54].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x5247.scenario> setfield SandboxWeapons[54].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x5247.scenario> setfield SandboxWeapons[55].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x5247.scenario> setfield SandboxWeapons[55].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x5247.scenario> setfield SandboxWeapons[56].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x5247.scenario> setfield SandboxWeapons[56].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x5247.scenario> setfield SandboxWeapons[57].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x5247.scenario> setfield SandboxWeapons[57].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x5247.scenario> setfield SandboxWeapons[58].object 53A2
Object: TagInstance = 0x000053A2

tags.dat\0x5247.scenario> setfield SandboxWeapons[58].name Highground_ProwlerTurret
Name: StringID = Highground_ProwlerTurret

tags.dat\0x5247.scenario> setfield SandboxWeapons[59].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x5247.scenario> setfield SandboxWeapons[59].name flag
Name: StringID = flag

tags.dat\0x5247.scenario> setfield SandboxWeapons[60].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x5247.scenario> setfield SandboxWeapons[60].name Oddball
Name: StringID = Oddball

tags.dat\0x5247.scenario> setfield SandboxWeapons[61].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x5247.scenario> setfield SandboxWeapons[61].name Bomb
Name: StringID = Bomb

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5247.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x5247.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x5247.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x5247.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x5247.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x5247.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x5247.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x5247.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x5247.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x5247.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x5247.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x5247.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x5247.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x5247.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x5247.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x5247.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x5247.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x5247.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> removefrom SandboxVehicles 7 *
Successfully removed 1 element from SandboxVehicles at index 7: List`1<SandboxObject>
{...}[7]

tags.dat\0x5247.scenario> addto SandboxVehicles 3
Successfully added 3 elements to SandboxVehicles: List`1<SandboxObject>
{...}[10]

tags.dat\0x5247.scenario> setfield SandboxVehicles[7].object 4442
Object: TagInstance = 0x00004442

tags.dat\0x5247.scenario> setfield SandboxVehicles[8].object 4443
Object: TagInstance = 0x00004443

tags.dat\0x5247.scenario> setfield SandboxVehicles[9].object 4447
Object: TagInstance = 0x00004447

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> setfield SandboxVehicles[7].name sandtrap_warthog_1
Name: StringID = sandtrap_warthog_1

tags.dat\0x5247.scenario> setfield SandboxVehicles[8].name sandtrap_warthog_2
Name: StringID = sandtrap_warthog_2

tags.dat\0x5247.scenario> setfield SandboxVehicles[9].name sandtrap_warthog_3
Name: StringID = sandtrap_warthog_3

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> echo  maxing forge pallete for High Ground
maxing forge pallete for High Ground 
tags.dat\0x5247.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[23].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[24].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[25].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[26].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[27].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[28].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[29].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxScenery[30].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxVehicles[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.scenario> 

tags.dat\0x5247.scenario> savechanges
Done!

tags.dat\0x5247.scenario> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of Sandtrap
edit the scnr of Sandtrap 
tags.dat> edit 54E9
Tag 0x000054E9.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x54E9.scenario> echo  Adds entrys to forge menu
Adds entrys to forge menu 
tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> removefrom SandboxVehicles 9 *
Successfully removed 1 element from SandboxVehicles at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x54E9.scenario> addto SandboxVehicles 3
Successfully added 3 elements to SandboxVehicles: List`1<SandboxObject>
{...}[12]

tags.dat\0x54E9.scenario> setfield SandboxVehicles[9].object 4442
Object: TagInstance = 0x00004442

tags.dat\0x54E9.scenario> setfield SandboxVehicles[10].object 4443
Object: TagInstance = 0x00004443

tags.dat\0x54E9.scenario> setfield SandboxVehicles[11].object 4447
Object: TagInstance = 0x00004447

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> setfield SandboxVehicles[9].name sandtrap_warthog_1
Name: StringID = sandtrap_warthog_1

tags.dat\0x54E9.scenario> setfield SandboxVehicles[10].name sandtrap_warthog_2
Name: StringID = sandtrap_warthog_2

tags.dat\0x54E9.scenario> setfield SandboxVehicles[11].name sandtrap_warthog_3
Name: StringID = sandtrap_warthog_3

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> removefrom sandboxScenery 22 *
Invalid index specified: 22
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54E9.scenario> addto sandboxScenery 17
Successfully added 17 elements to SandboxScenery: List`1<SandboxObject>
{...}[39]

tags.dat\0x54E9.scenario> setfield SandboxScenery[22].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x54E9.scenario> setfield SandboxScenery[23].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x54E9.scenario> setfield SandboxScenery[24].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x54E9.scenario> setfield SandboxScenery[25].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x54E9.scenario> setfield SandboxScenery[26].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x54E9.scenario> setfield SandboxScenery[27].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x54E9.scenario> setfield SandboxScenery[28].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x54E9.scenario> setfield SandboxScenery[29].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x54E9.scenario> setfield SandboxScenery[30].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x54E9.scenario> setfield SandboxScenery[31].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x54E9.scenario> setfield SandboxScenery[32].object 5628
Object: TagInstance = 0x00005628

tags.dat\0x54E9.scenario> setfield SandboxScenery[33].object 56EC
Object: TagInstance = 0x000056EC

tags.dat\0x54E9.scenario> setfield SandboxScenery[34].object 56F5
Object: TagInstance = 0x000056F5

tags.dat\0x54E9.scenario> setfield SandboxScenery[35].object 56FF
Object: TagInstance = 0x000056FF

tags.dat\0x54E9.scenario> setfield SandboxScenery[36].object 5709
Object: TagInstance = 0x00005709

tags.dat\0x54E9.scenario> setfield SandboxScenery[37].object 5713
Object: TagInstance = 0x00005713

tags.dat\0x54E9.scenario> setfield SandboxScenery[38].object 5699
Object: TagInstance = 0x00005699

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> setfield sandboxScenery[22].name box_s
Name: StringID = box_s

tags.dat\0x54E9.scenario> setfield sandboxScenery[23].name box_m
Name: StringID = box_m

tags.dat\0x54E9.scenario> setfield sandboxScenery[24].name box_l
Name: StringID = box_l

tags.dat\0x54E9.scenario> setfield sandboxScenery[25].name box_xl
Name: StringID = box_xl

tags.dat\0x54E9.scenario> setfield sandboxScenery[26].name box_xxl
Name: StringID = box_xxl

tags.dat\0x54E9.scenario> setfield sandboxScenery[27].name wall_s
Name: StringID = wall_s

tags.dat\0x54E9.scenario> setfield sandboxScenery[28].name wall_m
Name: StringID = wall_m

tags.dat\0x54E9.scenario> setfield sandboxScenery[29].name wall_l
Name: StringID = wall_l

tags.dat\0x54E9.scenario> setfield sandboxScenery[30].name wall_xl
Name: StringID = wall_xl

tags.dat\0x54E9.scenario> setfield sandboxScenery[31].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x54E9.scenario> setfield sandboxScenery[32].name elephant
Name: StringID = elephant

tags.dat\0x54E9.scenario> setfield SandboxScenery[33].name Sandtrap_UsncMetal
Name: StringID = Sandtrap_UsncMetal

tags.dat\0x54E9.scenario> setfield SandboxScenery[34].name Sandtrap_GravityLift
Name: StringID = Sandtrap_GravityLift

tags.dat\0x54E9.scenario> setfield SandboxScenery[35].name Sandtrap_Barrel
Name: StringID = Sandtrap_Barrel

tags.dat\0x54E9.scenario> setfield SandboxScenery[36].name Sandtrap_crowbar
Name: StringID = Sandtrap_crowbar

tags.dat\0x54E9.scenario> setfield SandboxScenery[37].name Sandtrap_Metal_plate 
Name: StringID = Sandtrap_Metal_plate

tags.dat\0x54E9.scenario> setfield SandboxScenery[38].name Sandtrap_Davinci_egg  
Name: StringID = Sandtrap_Davinci_egg

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> removefrom SandboxWeapons 18 *
Invalid index specified: 18
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54E9.scenario> addto SandboxWeapons 40
Successfully added 40 elements to SandboxWeapons: List`1<SandboxObject>
{...}[58]

tags.dat\0x54E9.scenario> setfield SandboxWeapons[18].object 1595
Object: TagInstance = 0x00001595

tags.dat\0x54E9.scenario> setfield SandboxWeapons[18].name plasma_pistol_pwr
Name: StringID = plasma_pistol_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[19].object 1525
Object: TagInstance = 0x00001525

tags.dat\0x54E9.scenario> setfield SandboxWeapons[19].name plasma_rifle
Name: StringID = plasma_rifle

tags.dat\0x54E9.scenario> setfield SandboxWeapons[20].object 1590
Object: TagInstance = 0x00001590

tags.dat\0x54E9.scenario> setfield SandboxWeapons[20].name plasma_riflev6
Name: StringID = plasma_riflev6

tags.dat\0x54E9.scenario> setfield SandboxWeapons[21].object 1581
Object: TagInstance = 0x00001581

tags.dat\0x54E9.scenario> setfield SandboxWeapons[21].name assault_rifle_dmg
Name: StringID = assault_rifle_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[22].object 1582
Object: TagInstance = 0x00001582

tags.dat\0x54E9.scenario> setfield SandboxWeapons[22].name assault_rifle_rof
Name: StringID = assault_rifle_rof

tags.dat\0x54E9.scenario> setfield SandboxWeapons[23].object 1583
Object: TagInstance = 0x00001583

tags.dat\0x54E9.scenario> setfield SandboxWeapons[23].name assault_rifle_acc
Name: StringID = assault_rifle_acc

tags.dat\0x54E9.scenario> setfield SandboxWeapons[24].object 1584
Object: TagInstance = 0x00001584

tags.dat\0x54E9.scenario> setfield SandboxWeapons[24].name assault_rifle_pwr
Name: StringID = assault_rifle_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[25].object 15BB
Object: TagInstance = 0x000015BB

tags.dat\0x54E9.scenario> setfield SandboxWeapons[25].name battle_rifle_rof
Name: StringID = battle_rifle_rof

tags.dat\0x54E9.scenario> setfield SandboxWeapons[26].object 15BC
Object: TagInstance = 0x000015BC

tags.dat\0x54E9.scenario> setfield SandboxWeapons[26].name battle_rifle_acc
Name: StringID = battle_rifle_acc

tags.dat\0x54E9.scenario> setfield SandboxWeapons[27].object 1585
Object: TagInstance = 0x00001585

tags.dat\0x54E9.scenario> setfield SandboxWeapons[27].name battle_rifle_mag
Name: StringID = battle_rifle_mag

tags.dat\0x54E9.scenario> setfield SandboxWeapons[28].object 1586
Object: TagInstance = 0x00001586

tags.dat\0x54E9.scenario> setfield SandboxWeapons[28].name battle_rifle_dmg
Name: StringID = battle_rifle_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[29].object 15BD
Object: TagInstance = 0x000015BD

tags.dat\0x54E9.scenario> setfield SandboxWeapons[29].name battle_rifle_rng
Name: StringID = battle_rifle_rng

tags.dat\0x54E9.scenario> setfield SandboxWeapons[30].object 1587
Object: TagInstance = 0x00001587

tags.dat\0x54E9.scenario> setfield SandboxWeapons[30].name battle_rifle_pwr
Name: StringID = battle_rifle_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[31].object 1580
Object: TagInstance = 0x00001580

tags.dat\0x54E9.scenario> setfield SandboxWeapons[31].name dmr
Name: StringID = dmr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[32].object 15BF
Object: TagInstance = 0x000015BF

tags.dat\0x54E9.scenario> setfield SandboxWeapons[32].name dmr_rng
Name: StringID = dmr_rng

tags.dat\0x54E9.scenario> setfield SandboxWeapons[33].object 1588
Object: TagInstance = 0x00001588

tags.dat\0x54E9.scenario> setfield SandboxWeapons[33].name dmr_acc
Name: StringID = dmr_acc

tags.dat\0x54E9.scenario> setfield SandboxWeapons[34].object 1589
Object: TagInstance = 0x00001589

tags.dat\0x54E9.scenario> setfield SandboxWeapons[34].name dmr_rof
Name: StringID = dmr_rof

tags.dat\0x54E9.scenario> setfield SandboxWeapons[35].object 158A
Object: TagInstance = 0x0000158A

tags.dat\0x54E9.scenario> setfield SandboxWeapons[35].name dmr_dmg
Name: StringID = dmr_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[36].object 15BE
Object: TagInstance = 0x000015BE

tags.dat\0x54E9.scenario> setfield SandboxWeapons[36].name dmr_mag
Name: StringID = dmr_mag

tags.dat\0x54E9.scenario> setfield SandboxWeapons[37].object 158B
Object: TagInstance = 0x0000158B

tags.dat\0x54E9.scenario> setfield SandboxWeapons[37].name dmr_pwr
Name: StringID = dmr_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[38].object 15C0
Object: TagInstance = 0x000015C0

tags.dat\0x54E9.scenario> setfield SandboxWeapons[38].name carbine_rof
Name: StringID = carbine_rof

tags.dat\0x54E9.scenario> setfield SandboxWeapons[39].object 15C1
Object: TagInstance = 0x000015C1

tags.dat\0x54E9.scenario> setfield SandboxWeapons[39].name carbine_mag
Name: StringID = carbine_mag

tags.dat\0x54E9.scenario> setfield SandboxWeapons[40].object 15C2
Object: TagInstance = 0x000015C2

tags.dat\0x54E9.scenario> setfield SandboxWeapons[40].name carbine_rng
Name: StringID = carbine_rng

tags.dat\0x54E9.scenario> setfield SandboxWeapons[41].object 15C3
Object: TagInstance = 0x000015C3

tags.dat\0x54E9.scenario> setfield SandboxWeapons[41].name carbine_dmg
Name: StringID = carbine_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[42].object 15C5
Object: TagInstance = 0x000015C5

tags.dat\0x54E9.scenario> setfield SandboxWeapons[42].name carbine_acc
Name: StringID = carbine_acc

tags.dat\0x54E9.scenario> setfield SandboxWeapons[43].object 1591
Object: TagInstance = 0x00001591

tags.dat\0x54E9.scenario> setfield SandboxWeapons[43].name carbine_pwr
Name: StringID = carbine_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[44].object 158C
Object: TagInstance = 0x0000158C

tags.dat\0x54E9.scenario> setfield SandboxWeapons[44].name smg_rof
Name: StringID = smg_rof

tags.dat\0x54E9.scenario> setfield SandboxWeapons[45].object 158D
Object: TagInstance = 0x0000158D

tags.dat\0x54E9.scenario> setfield SandboxWeapons[45].name smg_acc
Name: StringID = smg_acc

tags.dat\0x54E9.scenario> setfield SandboxWeapons[46].object 158E
Object: TagInstance = 0x0000158E

tags.dat\0x54E9.scenario> setfield SandboxWeapons[46].name smg_dmg
Name: StringID = smg_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[47].object 158F
Object: TagInstance = 0x0000158F

tags.dat\0x54E9.scenario> setfield SandboxWeapons[47].name smg_pwr
Name: StringID = smg_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[48].object 1593
Object: TagInstance = 0x00001593

tags.dat\0x54E9.scenario> setfield SandboxWeapons[48].name magnum_dmg
Name: StringID = magnum_dmg

tags.dat\0x54E9.scenario> setfield SandboxWeapons[49].object 1594
Object: TagInstance = 0x00001594

tags.dat\0x54E9.scenario> setfield SandboxWeapons[49].name magnum_pwr
Name: StringID = magnum_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[50].object 1592
Object: TagInstance = 0x00001592

tags.dat\0x54E9.scenario> setfield SandboxWeapons[50].name mauler_pwr
Name: StringID = mauler_pwr

tags.dat\0x54E9.scenario> setfield SandboxWeapons[51].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x54E9.scenario> setfield SandboxWeapons[51].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x54E9.scenario> setfield SandboxWeapons[52].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x54E9.scenario> setfield SandboxWeapons[52].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x54E9.scenario> setfield SandboxWeapons[53].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x54E9.scenario> setfield SandboxWeapons[53].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x54E9.scenario> setfield SandboxWeapons[54].object 53A2
Object: TagInstance = 0x000053A2

tags.dat\0x54E9.scenario> setfield SandboxWeapons[54].name Highground_ProwlerTurret
Name: StringID = Highground_ProwlerTurret

tags.dat\0x54E9.scenario> setfield SandboxWeapons[55].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x54E9.scenario> setfield SandboxWeapons[55].name flag
Name: StringID = flag

tags.dat\0x54E9.scenario> setfield SandboxWeapons[56].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x54E9.scenario> setfield SandboxWeapons[56].name Oddball
Name: StringID = Oddball

tags.dat\0x54E9.scenario> setfield SandboxWeapons[57].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x54E9.scenario> setfield SandboxWeapons[57].name Bomb
Name: StringID = Bomb

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> removefrom sandboxEquipment 15 *
Invalid index specified: 15
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54E9.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[22]

tags.dat\0x54E9.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x54E9.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x54E9.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x54E9.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x54E9.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x54E9.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x54E9.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x54E9.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x54E9.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x54E9.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x54E9.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x54E9.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x54E9.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x54E9.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x54E9.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x54E9.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x54E9.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> echo  maxing forge pallete for Sandtrap
maxing forge pallete for Sandtrap 
tags.dat\0x54E9.scenario> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxVehicles[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> 

tags.dat\0x54E9.scenario> savechanges
Done!

tags.dat\0x54E9.scenario> exit

tags.dat> 

tags.dat> echo   edit the scnr of Guardian
edit the scnr of Guardian 
tags.dat> edit 2E8A
Tag 0x00002E8A.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2E8A.scenario> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x2E8A.scenario> removefrom sandboxScenery 48 *
Invalid index specified: 48
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> echo forge pallete limit is 64
forge pallete limit is 64 
tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> removefrom sandboxGoalObjects 9 *
Invalid index specified: 9
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2E8A.scenario> addto sandboxGoalObjects 4
Successfully added 4 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[13]

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[9].object 2ED9
Object: TagInstance = 0x00002ED9

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[10].object 2EDA
Object: TagInstance = 0x00002EDA

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[11].object 2EDB
Object: TagInstance = 0x00002EDB

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[12].object 2EDD
Object: TagInstance = 0x00002EDD

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[9].name Guardian_GoldLift
Name: StringID = Guardian_GoldLift

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[10].name Guardian_MancannonLift 
Name: StringID = Guardian_MancannonLift

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[11].name Guardian_Mancannonlift2
Name: StringID = Guardian_Mancannonlift2

tags.dat\0x2E8A.scenario> setfield SandboxGoalObjects[12].name Guardian_Minilift 
Name: StringID = Guardian_Minilift

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> addto sandboxScenery 10
Successfully added 10 elements to SandboxScenery: List`1<SandboxObject>
{...}[58]

tags.dat\0x2E8A.scenario> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x2E8A.scenario> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x2E8A.scenario> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x2E8A.scenario> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x2E8A.scenario> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x2E8A.scenario> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x2E8A.scenario> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x2E8A.scenario> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x2E8A.scenario> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x2E8A.scenario> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x2E8A.scenario> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x2E8A.scenario> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x2E8A.scenario> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x2E8A.scenario> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x2E8A.scenario> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x2E8A.scenario> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x2E8A.scenario> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x2E8A.scenario> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x2E8A.scenario> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> removefrom SandboxWeapons 57 *
Invalid index specified: 57
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2E8A.scenario> addto SandboxWeapons 6
Successfully added 6 elements to SandboxWeapons: List`1<SandboxObject>
{...}[63]

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[57].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[57].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[58].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[58].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[60].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[60].name flag
Name: StringID = flag

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[61].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[61].name Oddball
Name: StringID = Oddball

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[62].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x2E8A.scenario> setfield SandboxWeapons[62].name Bomb
Name: StringID = Bomb

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> removefrom sandboxEquipment 15 *
Successfully removed 2 elements from SandboxEquipment at index 15: List`1<SandboxObject>
{...}[15]

tags.dat\0x2E8A.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x2E8A.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x2E8A.scenario> 

tags.dat\0x2E8A.scenario> savechanges
Done!

tags.dat\0x2E8A.scenario> exit

tags.dat> 

tags.dat> echo   edit the scnr of Diamondback
edit the scnr of Diamondback 
tags.dat> edit 3A0E
Tag 0x00003A0E.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A0E.scenario> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3A0E.scenario> removefrom sandboxScenery 48 *
Invalid index specified: 48
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x3A0E.scenario> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x3A0E.scenario> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x3A0E.scenario> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x3A0E.scenario> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x3A0E.scenario> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x3A0E.scenario> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x3A0E.scenario> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x3A0E.scenario> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x3A0E.scenario> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x3A0E.scenario> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x3A0E.scenario> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x3A0E.scenario> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3A0E.scenario> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x3A0E.scenario> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x3A0E.scenario> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x3A0E.scenario> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x3A0E.scenario> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x3A0E.scenario> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x3A0E.scenario> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x3A0E.scenario> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x3A0E.scenario> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x3A0E.scenario> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x3A0E.scenario> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x3A0E.scenario> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x3A0E.scenario> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x3A0E.scenario> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> removefrom sandboxGoalObjects 9 *
Invalid index specified: 9
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3A0E.scenario> addto sandboxGoalObjects 6
Successfully added 6 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[15]

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[9].object 3A9F
Object: TagInstance = 0x00003A9F

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[10].object 3AA0
Object: TagInstance = 0x00003AA0

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[11].object 3AA1
Object: TagInstance = 0x00003AA1

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[12].object 3AA2
Object: TagInstance = 0x00003AA2

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[13].object 3AA3
Object: TagInstance = 0x00003AA3

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[14].object 3AA4
Object: TagInstance = 0x00003AA4

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[9].name Diamondback_Gravitylift1
Name: StringID = Diamondback_Gravitylift1

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[10].name Diamondback_Gravitylift2
Name: StringID = Diamondback_Gravitylift2

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[11].name Diamondback_Gravitylift3
Name: StringID = Diamondback_Gravitylift3

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[12].name Diamondback_Gravitylift4
Name: StringID = Diamondback_Gravitylift4

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[13].name Diamondback_Gravitylift5
Name: StringID = Diamondback_Gravitylift5

tags.dat\0x3A0E.scenario> setfield SandboxGoalObjects[14].name Diamondback_Gravitylift6
Name: StringID = Diamondback_Gravitylift6

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> removefrom sandboxEquipment 15 *
Successfully removed 2 elements from SandboxEquipment at index 15: List`1<SandboxObject>
{...}[15]

tags.dat\0x3A0E.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x3A0E.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> removefrom SandboxWeapons 57 *
Invalid index specified: 57
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3A0E.scenario> addto SandboxWeapons 5
Successfully added 5 elements to SandboxWeapons: List`1<SandboxObject>
{...}[62]

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[57].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[57].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[58].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[58].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[59].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[59].name flag
Name: StringID = flag

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[60].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[60].name Oddball
Name: StringID = Oddball

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[61].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x3A0E.scenario> setfield SandboxWeapons[61].name Bomb
Name: StringID = Bomb

tags.dat\0x3A0E.scenario> 

tags.dat\0x3A0E.scenario> savechanges
Done!

tags.dat\0x3A0E.scenario> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of Reactor
edit the scnr of Reactor 
tags.dat> edit 3F83
Tag 0x00003F83.scenario has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F83.scenario> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> removefrom sandboxScenery 48 *
Invalid index specified: 48
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3F83.scenario> addto sandboxScenery 4
Successfully added 4 elements to SandboxScenery: List`1<SandboxObject>
{...}[52]

tags.dat\0x3F83.scenario> setfield SandboxScenery[48].object 27C7
Object: TagInstance = 0x000027C7

tags.dat\0x3F83.scenario> setfield SandboxScenery[49].object 3F8A
Object: TagInstance = 0x00003F8A

tags.dat\0x3F83.scenario> setfield SandboxScenery[50].object 3F8B
Object: TagInstance = 0x00003F8B

tags.dat\0x3F83.scenario> setfield SandboxScenery[51].object 3F8C
Object: TagInstance = 0x00003F8C

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> setfield SandboxScenery[48].name reactor_pelican
Name: StringID = reactor_pelican

tags.dat\0x3F83.scenario> setfield SandboxScenery[49].name reactor_redlight
Name: StringID = reactor_redlight

tags.dat\0x3F83.scenario> setfield SandboxScenery[50].name reactor_bluelight 
Name: StringID = reactor_bluelight

tags.dat\0x3F83.scenario> setfield SandboxScenery[51].name reactor_yellowlight
Name: StringID = reactor_yellowlight

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> removefrom sandboxEquipment 15 *
Successfully removed 2 elements from SandboxEquipment at index 15: List`1<SandboxObject>
{...}[15]

tags.dat\0x3F83.scenario> addto sandboxEquipment 9
Successfully added 9 elements to SandboxEquipment: List`1<SandboxObject>
{...}[24]

tags.dat\0x3F83.scenario> setfield SandboxEquipment[0].object 196E
Object: TagInstance = 0x0000196E

tags.dat\0x3F83.scenario> setfield SandboxEquipment[1].object 1A6E
Object: TagInstance = 0x00001A6E

tags.dat\0x3F83.scenario> setfield SandboxEquipment[2].object 15D2
Object: TagInstance = 0x000015D2

tags.dat\0x3F83.scenario> setfield SandboxEquipment[3].object 19C5
Object: TagInstance = 0x000019C5

tags.dat\0x3F83.scenario> setfield SandboxEquipment[4].object 18AC
Object: TagInstance = 0x000018AC

tags.dat\0x3F83.scenario> setfield SandboxEquipment[5].object 15D3
Object: TagInstance = 0x000015D3

tags.dat\0x3F83.scenario> setfield SandboxEquipment[6].object 15D1
Object: TagInstance = 0x000015D1

tags.dat\0x3F83.scenario> setfield SandboxEquipment[7].object 15D5
Object: TagInstance = 0x000015D5

tags.dat\0x3F83.scenario> setfield SandboxEquipment[8].object 15D4
Object: TagInstance = 0x000015D4

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> setfield SandboxEquipment[0].name BubbleShield
Name: StringID = BubbleShield

tags.dat\0x3F83.scenario> setfield SandboxEquipment[1].name DeployableCover
Name: StringID = DeployableCover

tags.dat\0x3F83.scenario> setfield SandboxEquipment[2].name PowerDrain
Name: StringID = PowerDrain

tags.dat\0x3F83.scenario> setfield SandboxEquipment[3].name Regen
Name: StringID = Regen

tags.dat\0x3F83.scenario> setfield SandboxEquipment[4].name radarjammer
Name: StringID = radarjammer

tags.dat\0x3F83.scenario> setfield SandboxEquipment[5].name flare
Name: StringID = flare

tags.dat\0x3F83.scenario> setfield SandboxEquipment[6].name tripmine
Name: StringID = tripmine

tags.dat\0x3F83.scenario> setfield SandboxEquipment[7].name yellowpowerdrain
Name: StringID = yellowpowerdrain

tags.dat\0x3F83.scenario> setfield SandboxEquipment[8].name scrambler 
Name: StringID = scrambler

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> removefrom SandboxWeapons 57 *
Invalid index specified: 57
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenario definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3F83.scenario> addto SandboxWeapons 5
Successfully added 5 elements to SandboxWeapons: List`1<SandboxObject>
{...}[62]

tags.dat\0x3F83.scenario> setfield SandboxWeapons[57].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3F83.scenario> setfield SandboxWeapons[57].name Gauss_Turret
Name: StringID = Gauss_Turret

tags.dat\0x3F83.scenario> setfield SandboxWeapons[58].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3F83.scenario> setfield SandboxWeapons[58].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3F83.scenario> setfield SandboxWeapons[59].object 15a2
Object: TagInstance = 0x000015A2

tags.dat\0x3F83.scenario> setfield SandboxWeapons[59].name flag
Name: StringID = flag

tags.dat\0x3F83.scenario> setfield SandboxWeapons[60].object 15a3
Object: TagInstance = 0x000015A3

tags.dat\0x3F83.scenario> setfield SandboxWeapons[60].name Oddball
Name: StringID = Oddball

tags.dat\0x3F83.scenario> setfield SandboxWeapons[61].object 15a4
Object: TagInstance = 0x000015A4

tags.dat\0x3F83.scenario> setfield SandboxWeapons[61].name Bomb
Name: StringID = Bomb

tags.dat\0x3F83.scenario> 

tags.dat\0x3F83.scenario> savechanges
Done!

tags.dat\0x3F83.scenario> exit

tags.dat> 

tags.dat> 

tags.dat> edit 157B
Tag 0x0000157B.sandbox_text_value_pair_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x157B.sandbox_text_value_pair_definition> echo  editing sandbox propities menu
editing sandbox propities menu 
tags.dat\0x157B.sandbox_text_value_pair_definition> 

tags.dat\0x157B.sandbox_text_value_pair_definition> removefrom sandboxTextValuepairs[1].textvalueparis 2 *
Successfully removed 1 element from TextValueParis at index 2: List`1<TextValuePari>
{...}[2]

tags.dat\0x157B.sandbox_text_value_pair_definition> addto sandboxTextValuepairs[1].textvalueparis 5
Successfully added 5 elements to TextValueParis: List`1<TextValuePari>
{...}[7]

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[1].TextValueParis[2].intValue 2
IntValue: Int32 = 2

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[1].TextValueParis[3].intValue 3
IntValue: Int32 = 3

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[1].TextValueParis[4].intValue 4
IntValue: Int32 = 4

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[1].TextValueParis[5].intValue 5
IntValue: Int32 = 5

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[1].TextValueParis[6].intValue 10
IntValue: Int32 = 10

tags.dat\0x157B.sandbox_text_value_pair_definition> 

tags.dat\0x157B.sandbox_text_value_pair_definition> removefrom sandboxTextValuepairs[3].textvalueparis 10 *
Successfully removed 1 element from TextValueParis at index 10: List`1<TextValuePari>
{...}[10]

tags.dat\0x157B.sandbox_text_value_pair_definition> addto sandboxTextValuepairs[3].textvalueparis 11
Successfully added 11 elements to TextValueParis: List`1<TextValuePari>
{...}[21]

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[11].intValue 11
IntValue: Int32 = 11

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[12].intValue 12
IntValue: Int32 = 12

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[13].intValue 13
IntValue: Int32 = 13

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[14].intValue 14
IntValue: Int32 = 14

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[15].intValue 15
IntValue: Int32 = 15

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[16].intValue 16
IntValue: Int32 = 16

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[17].intValue 17
IntValue: Int32 = 17

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[18].intValue 18
IntValue: Int32 = 18

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[19].intValue 19
IntValue: Int32 = 19

tags.dat\0x157B.sandbox_text_value_pair_definition> setfield sandboxTextValuepairs[3].TextValueParis[20].intValue 20
IntValue: Int32 = 20

tags.dat\0x157B.sandbox_text_value_pair_definition> savechanges
Done!

tags.dat\0x157B.sandbox_text_value_pair_definition> exit

tags.dat> 

tags.dat> edit 29ED
Tag 0x000029ED.vehicle has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x29ED.vehicle> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Vehicle definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x29ED.vehicle> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x29ED.vehicle> savechanges
Done!

tags.dat\0x29ED.vehicle> exit

tags.dat> 

tags.dat> edit 29EC
Tag 0x000029EC.vehicle has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x29EC.vehicle> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Vehicle definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x29EC.vehicle> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x29EC.vehicle> savechanges
Done!

tags.dat\0x29EC.vehicle> exit

tags.dat> 

tags.dat> edit 3743
Tag 0x00003743.vehicle has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3743.vehicle> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Vehicle definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3743.vehicle> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3743.vehicle> savechanges
Done!

tags.dat\0x3743.vehicle> exit

tags.dat> 

tags.dat> echo making objects on last resort editable 
making objects on last resort editable 
tags.dat> 

tags.dat> edit 51C7
Tag 0x000051C7.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51C7.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x51C7.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51C7.crate> savechanges
Done!

tags.dat\0x51C7.crate> exit

tags.dat> 

tags.dat> edit 5210
Tag 0x00005210.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5210.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5210.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5210.crate> savechanges
Done!

tags.dat\0x5210.crate> exit

tags.dat> 

tags.dat> edit 51FD
Tag 0x000051FD.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51FD.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x51FD.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51FD.crate> savechanges
Done!

tags.dat\0x51FD.crate> exit

tags.dat> 

tags.dat> edit 51EA
Tag 0x000051EA.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51EA.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x51EA.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51EA.crate> savechanges
Done!

tags.dat\0x51EA.crate> exit

tags.dat> 

tags.dat> edit 521A
Tag 0x0000521A.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x521A.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x521A.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x521A.crate> savechanges
Done!

tags.dat\0x521A.crate> exit

tags.dat> 

tags.dat> edit 5225
Tag 0x00005225.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5225.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5225.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5225.crate> savechanges
Done!

tags.dat\0x5225.crate> exit

tags.dat> 

tags.dat> edit 522A
Tag 0x0000522A.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x522A.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x522A.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x522A.crate> savechanges
Done!

tags.dat\0x522A.crate> exit

tags.dat> 

tags.dat> edit 5239
Tag 0x00005239.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5239.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5239.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5239.crate> savechanges
Done!

tags.dat\0x5239.crate> exit

tags.dat> 

tags.dat> 

tags.dat> 

tags.dat> echo making objects on last resort editable 
making objects on last resort editable 
tags.dat> 

tags.dat> edit 48EF
Tag 0x000048EF.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x48EF.crate> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x48EF.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x48EF.crate> savechanges
Done!

tags.dat\0x48EF.crate> exit

tags.dat> 

tags.dat> edit 4904
Tag 0x00004904.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4904.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4904.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4904.crate> savechanges
Done!

tags.dat\0x4904.crate> exit

tags.dat> 

tags.dat> edit 490E
Tag 0x0000490E.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x490E.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x490E.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x490E.crate> savechanges
Done!

tags.dat\0x490E.crate> exit

tags.dat> 

tags.dat> edit 4918
Tag 0x00004918.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4918.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4918.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4918.crate> savechanges
Done!

tags.dat\0x4918.crate> exit

tags.dat> 

tags.dat> edit 4923
Tag 0x00004923.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4923.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4923.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4923.crate> savechanges
Done!

tags.dat\0x4923.crate> exit

tags.dat> 

tags.dat> edit 492F
Tag 0x0000492F.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x492F.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x492F.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x492F.crate> savechanges
Done!

tags.dat\0x492F.crate> exit

tags.dat> 

tags.dat> edit 4934
Tag 0x00004934.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4934.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4934.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4934.crate> savechanges
Done!

tags.dat\0x4934.crate> exit

tags.dat> 

tags.dat> edit 4950
Tag 0x00004950.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4950.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4950.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4950.crate> savechanges
Done!

tags.dat\0x4950.crate> exit

tags.dat> 

tags.dat> edit 49B1
Tag 0x000049B1.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49B1.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x49B1.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49B1.crate> savechanges
Done!

tags.dat\0x49B1.crate> exit

tags.dat> 

tags.dat> edit 49C3
Tag 0x000049C3.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49C3.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x49C3.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49C3.crate> savechanges
Done!

tags.dat\0x49C3.crate> exit

tags.dat> 

tags.dat> edit 49DE
Tag 0x000049DE.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49DE.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x49DE.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49DE.crate> savechanges
Done!

tags.dat\0x49DE.crate> exit

tags.dat> 

tags.dat> edit 4703
Tag 0x00004703.vehicle has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4703.vehicle> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4703.vehicle> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4703.vehicle> savechanges
Done!

tags.dat\0x4703.vehicle> exit

tags.dat> 

tags.dat> edit 4608
Tag 0x00004608.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4608.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4608.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4608.scenery> savechanges
Done!

tags.dat\0x4608.scenery> exit

tags.dat> 

tags.dat> edit 4686
Tag 0x00004686.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4686.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4686.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4686.scenery> savechanges
Done!

tags.dat\0x4686.scenery> exit

tags.dat> 

tags.dat> 

tags.dat> edit 469F
Tag 0x0000469F.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x469F.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x469F.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x469F.scenery> savechanges
Done!

tags.dat\0x469F.scenery> exit

tags.dat> 

tags.dat> edit 46D0
Tag 0x000046D0.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46D0.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x46D0.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46D0.scenery> savechanges
Done!

tags.dat\0x46D0.scenery> exit

tags.dat> 

tags.dat> 

tags.dat> edit 461D
Tag 0x0000461D.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x461D.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x461D.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x461D.scenery> savechanges
Done!

tags.dat\0x461D.scenery> exit

tags.dat> 

tags.dat> edit 4628
Tag 0x00004628.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4628.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4628.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4628.scenery> savechanges
Done!

tags.dat\0x4628.scenery> exit

tags.dat> 

tags.dat> edit 4632
Tag 0x00004632.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4632.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4632.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4632.scenery> savechanges
Done!

tags.dat\0x4632.scenery> exit

tags.dat> 

tags.dat> edit 196E
Tag 0x0000196E.equipment has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x196E.equipment> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Equipment definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x196E.equipment> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x196E.equipment> savechanges
Done!

tags.dat\0x196E.equipment> exit

tags.dat> 

tags.dat> edit 1A6E
Tag 0x00001A6E.equipment has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1A6E.equipment> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Equipment definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x1A6E.equipment> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x1A6E.equipment> savechanges
Done!

tags.dat\0x1A6E.equipment> exit

tags.dat> 

tags.dat> edit 15D2
Tag 0x000015D2.equipment has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x15D2.equipment> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x15D2.equipment> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x15D2.equipment> savechanges
Done!

tags.dat\0x15D2.equipment> exit

tags.dat> 

tags.dat> edit 463D
Tag 0x0000463D.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x463D.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x463D.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x463D.scenery> savechanges
Done!

tags.dat\0x463D.scenery> exit

tags.dat> 

tags.dat> edit 4643
Tag 0x00004643.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4643.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4643.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4643.scenery> savechanges
Done!

tags.dat\0x4643.scenery> exit

tags.dat> 

tags.dat> edit 4662
Tag 0x00004662.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4662.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4662.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4662.scenery> savechanges
Done!

tags.dat\0x4662.scenery> exit

tags.dat> 

tags.dat> edit 46BE
Tag 0x000046BE.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46BE.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x46BE.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46BE.scenery> savechanges
Done!

tags.dat\0x46BE.scenery> exit

tags.dat> 

tags.dat> edit 46C7
Tag 0x000046C7.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46C7.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x46C7.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46C7.scenery> savechanges
Done!

tags.dat\0x46C7.scenery> exit

tags.dat> 

tags.dat> edit 46CF
Tag 0x000046CF.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46CF.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x46CF.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46CF.scenery> savechanges
Done!

tags.dat\0x46CF.scenery> exit

tags.dat> 

tags.dat> 

tags.dat> edit 46A4
Tag 0x000046A4.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46A4.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x46A4.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46A4.scenery> savechanges
Done!

tags.dat\0x46A4.scenery> exit

tags.dat> 

tags.dat> 

tags.dat> 

tags.dat> echo narrows
narrows 
tags.dat> 

tags.dat> edit 4B5E
Tag 0x00004B5E.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B5E.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4B5E.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B5E.crate> savechanges
Done!

tags.dat\0x4B5E.crate> exit

tags.dat> 

tags.dat> edit 4B76
Tag 0x00004B76.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B76.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4B76.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B76.crate> savechanges
Done!

tags.dat\0x4B76.crate> exit

tags.dat> 

tags.dat> edit 4BC8
Tag 0x00004BC8.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4BC8.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4BC8.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4BC8.crate> savechanges
Done!

tags.dat\0x4BC8.crate> exit

tags.dat> 

tags.dat> edit 3E0B
Tag 0x00003E0B.creature has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3E0B.creature> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Creature definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3E0B.creature> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3E0B.creature> savechanges
Done!

tags.dat\0x3E0B.creature> exit

tags.dat> 

tags.dat> edit 4B4D
Tag 0x00004B4D.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B4D.scenery> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B4D.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B4D.scenery> savechanges
Done!

tags.dat\0x4B4D.scenery> exit

tags.dat> 

tags.dat> edit 4B4E
Tag 0x00004B4E.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B4E.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4B4E.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B4E.scenery> savechanges
Done!

tags.dat\0x4B4E.scenery> exit

tags.dat> 

tags.dat> edit 4B70
Tag 0x00004B70.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B70.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4B70.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B70.scenery> savechanges
Done!

tags.dat\0x4B70.scenery> exit

tags.dat> 

tags.dat> edit 4B7B
Tag 0x00004B7B.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B7B.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4B7B.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B7B.scenery> savechanges
Done!

tags.dat\0x4B7B.scenery> exit

tags.dat> 

tags.dat> edit 3E0C
Tag 0x00003E0C.creature has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3E0C.creature> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Creature definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3E0C.creature> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3E0C.creature> savechanges
Done!

tags.dat\0x3E0C.creature> exit

tags.dat> 

tags.dat> edit 3495
Tag 0x00003495.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3495.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x3495.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3495.scenery> savechanges
Done!

tags.dat\0x3495.scenery> exit

tags.dat> 

tags.dat> echo making items on standoff editable
making items on standoff editable 
tags.dat> 

tags.dat> edit 4EF5
Tag 0x00004EF5.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4EF5.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4EF5.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4EF5.crate> savechanges
Done!

tags.dat\0x4EF5.crate> exit

tags.dat> 

tags.dat> edit 4F04
Tag 0x00004F04.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F04.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F04.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4F04.crate> savechanges
Done!

tags.dat\0x4F04.crate> exit

tags.dat> 

tags.dat> edit 4F09
Tag 0x00004F09.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F09.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x4F09.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4F09.crate> savechanges
Done!

tags.dat\0x4F09.crate> exit

tags.dat> 

tags.dat> 

tags.dat> 

tags.dat> echo making items on highground editable
making items on highground editable 
tags.dat> 

tags.dat> edit 5495
Tag 0x00005495.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5495.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5495.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5495.crate> savechanges
Done!

tags.dat\0x5495.crate> exit

tags.dat> 

tags.dat> edit 54A2
Tag 0x000054A2.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54A2.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54A2.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54A2.crate> savechanges
Done!

tags.dat\0x54A2.crate> exit

tags.dat> 

tags.dat> edit 54AB
Tag 0x000054AB.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54AB.crate> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54AB.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54AB.crate> savechanges
Done!

tags.dat\0x54AB.crate> exit

tags.dat> 

tags.dat> edit 54C7
Tag 0x000054C7.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54C7.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54C7.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54C7.crate> savechanges
Done!

tags.dat\0x54C7.crate> exit

tags.dat> 

tags.dat> edit 54CC
Tag 0x000054CC.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54CC.crate> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54CC.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54CC.crate> savechanges
Done!

tags.dat\0x54CC.crate> exit

tags.dat> 

tags.dat> edit 54D1
Tag 0x000054D1.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54D1.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54D1.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54D1.crate> savechanges
Done!

tags.dat\0x54D1.crate> exit

tags.dat> 

tags.dat> edit 54D7
Tag 0x000054D7.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54D7.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x54D7.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54D7.crate> savechanges
Done!

tags.dat\0x54D7.crate> exit

tags.dat> 

tags.dat> edit 53A2
Tag 0x000053A2.vehicle has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x53A2.vehicle> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Vehicle definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x53A2.vehicle> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x53A2.vehicle> savechanges
Done!

tags.dat\0x53A2.vehicle> exit

tags.dat> 

tags.dat> edit 348E
Tag 0x0000348E.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x348E.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x348E.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x348E.scenery> savechanges
Done!

tags.dat\0x348E.scenery> exit

tags.dat> 

tags.dat> edit 5324
Tag 0x00005324.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5324.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x5324.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5324.scenery> savechanges
Done!

tags.dat\0x5324.scenery> exit

tags.dat> 

tags.dat> edit 4608
Tag 0x00004608.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4608.scenery> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4608.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4608.scenery> savechanges
Done!

tags.dat\0x4608.scenery> exit

tags.dat> 

tags.dat> edit 532B
Tag 0x0000532B.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x532B.scenery> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Scenery definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x532B.scenery> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x532B.scenery> savechanges
Done!

tags.dat\0x532B.scenery> exit

tags.dat> 

tags.dat> edit 535F
Tag 0x0000535F.device_machine has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x535F.device_machine> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x535F.device_machine> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x535F.device_machine> savechanges
Done!

tags.dat\0x535F.device_machine> exit

tags.dat> 

tags.dat> echo making items editable on sandtrap
making items editable on sandtrap 
tags.dat> 

tags.dat> edit 56F5
Tag 0x000056F5.crate has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x56F5.crate> removefrom multiplayerObjectProperties 0 *
Invalid index specified: 0
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Crate definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x56F5.crate> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x56F5.crate> savechanges
Done!

tags.dat\0x56F5.crate> exit

tags.dat> 

tags.dat> edit 569E
Tag 0x0000569E.physics_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x569E.physics_model> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x569E.physics_model> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.
